mdhardenburgh/Cypress_PDL_2.1.0/devices/fm0p/s6e1b3xf/common/s6e1b3xf.h
#define FM_SMCIF0_BASE                            (0x4003C900UL) /* SMCIF0 Base Address */
#define FM0P_SMCIF0_BASE                          (0x4003C900UL) /* SMCIF0 Base Address */
#define FM_SMCIF1_BASE                            (0x4003C980UL) /* SMCIF1 Base Address */
#define FM0P_SMCIF1_BASE                          (0x4003C980UL) /* SMCIF1 Base Address */
#define FM_SWWDT_BASE                             (0x40012000UL) /* SWWDT Base Address */
#define FM0P_SWWDT_BASE                           (0x40012000UL) /* SWWDT Base Address */
#define FM_UNIQUE_ID_BASE                         (0x40000200UL) /* UNIQUE_ID Base Address */
#define FM0P_UNIQUE_ID_BASE                       (0x40000200UL) /* UNIQUE_ID Base Address */
#define FM_USB0_BASE                              (0x40040000UL) /* USB0 Base Address */
#define FM0P_USB0_BASE                            (0x40040000UL) /* USB0 Base Address */
#define FM_USBCLK_BASE                            (0x40036000UL) /* USBCLK Base Address */
#define FM0P_USBCLK_BASE                          (0x40036000UL) /* USBCLK Base Address */
#define FM_WC_BASE                                (0x4003A000UL) /* WC Base Address */
#define FM0P_WC_BASE                              (0x4003A000UL) /* WC Base Address */
/*******************************************************************************
* Peripheral declaration
*******************************************************************************/
#define FM0P_ADC0                                 ((FM_ADC_TypeDef *)FM0P_ADC0_BASE)
#define FM_ADC0                                   ((FM_ADC_TypeDef *)FM0P_ADC0_BASE)
#define FM0P_BT0                                  ((FM_BT_TypeDef *)FM0P_BT0_BASE)
#define FM_BT0                                    ((FM_BT_TypeDef *)FM0P_BT0_BASE)
#define FM0P_BT0_PPG                              ((FM_BT_PPG_TypeDef *)FM0P_BT0_BASE)
#define FM_BT0_PPG                                ((FM_BT_PPG_TypeDef *)FM0P_BT0_BASE)
#define FM0P_BT0_PWC                              ((FM_BT_PWC_TypeDef *)FM0P_BT0_BASE)
#define FM_BT0_PWC                                ((FM_BT_PWC_TypeDef *)FM0P_BT0_BASE)
#define FM0P_BT0_PWM                              ((FM_BT_PWM_TypeDef *)FM0P_BT0_BASE)
#define FM_BT0_PWM                                ((FM_BT_PWM_TypeDef *)FM0P_BT0_BASE)
#define FM0P_BT0_RT                               ((FM_BT_RT_TypeDef *)FM0P_BT0_BASE)
#define FM_BT0_RT                                 ((FM_BT_RT_TypeDef *)FM0P_BT0_BASE)
#define FM0P_BT1                                  ((FM_BT_TypeDef *)FM0P_BT1_BASE)
#define FM_BT1                                    ((FM_BT_TypeDef *)FM0P_BT1_BASE)
#define FM0P_BT1_PPG                              ((FM_BT_PPG_TypeDef *)FM0P_BT1_BASE)
#define FM_BT1_PPG                                ((FM_BT_PPG_TypeDef *)FM0P_BT1_BASE)
#define FM0P_BT1_PWC                              ((FM_BT_PWC_TypeDef *)FM0P_BT1_BASE)
#define FM_BT1_PWC                                ((FM_BT_PWC_TypeDef *)FM0P_BT1_BASE)
#define FM0P_BT1_PWM                              ((FM_BT_PWM_TypeDef *)FM0P_BT1_BASE)
#define FM_BT1_PWM                                ((FM_BT_PWM_TypeDef *)FM0P_BT1_BASE)
#define FM0P_BT1_RT                               ((FM_BT_RT_TypeDef *)FM0P_BT1_BASE)
#define FM_BT1_RT                                 ((FM_BT_RT_TypeDef *)FM0P_BT1_BASE)
#define FM0P_BT2                                  ((FM_BT_TypeDef *)FM0P_BT2_BASE)
#define FM_BT2                                    ((FM_BT_TypeDef *)FM0P_BT2_BASE)
#define FM0P_BT2_PPG                              ((FM_BT_PPG_TypeDef *)FM0P_BT2_BASE)
#define FM_BT2_PPG                                ((FM_BT_PPG_TypeDef *)FM0P_BT2_BASE)
#define FM0P_BT2_PWC                              ((FM_BT_PWC_TypeDef *)FM0P_BT2_BASE)
#define FM_BT2_PWC                                ((FM_BT_PWC_TypeDef *)FM0P_BT2_BASE)
#define FM0P_BT2_PWM                              ((FM_BT_PWM_TypeDef *)FM0P_BT2_BASE)
#define FM_BT2_PWM                                ((FM_BT_PWM_TypeDef *)FM0P_BT2_BASE)
#define FM0P_BT2_RT                               ((FM_BT_RT_TypeDef *)FM0P_BT2_BASE)
#define FM_BT2_RT                                 ((FM_BT_RT_TypeDef *)FM0P_BT2_BASE)
#define FM0P_BT3                                  ((FM_BT_TypeDef *)FM0P_BT3_BASE)
#define FM_BT3                                    ((FM_BT_TypeDef *)FM0P_BT3_BASE)
#define FM0P_BT3_PPG                              ((FM_BT_PPG_TypeDef *)FM0P_BT3_BASE)
#define FM_BT3_PPG                                ((FM_BT_PPG_TypeDef *)FM0P_BT3_BASE)
#define FM0P_BT3_PWC                              ((FM_BT_PWC_TypeDef *)FM0P_BT3_BASE)
#define FM_BT3_PWC                                ((FM_BT_PWC_TypeDef *)FM0P_BT3_BASE)
#define FM0P_BT3_PWM                              ((FM_BT_PWM_TypeDef *)FM0P_BT3_BASE)
#define FM_BT3_PWM                                ((FM_BT_PWM_TypeDef *)FM0P_BT3_BASE)
#define FM0P_BT3_RT                               ((FM_BT_RT_TypeDef *)FM0P_BT3_BASE)
#define FM_BT3_RT                                 ((FM_BT_RT_TypeDef *)FM0P_BT3_BASE)
#define FM0P_BT4                                  ((FM_BT_TypeDef *)FM0P_BT4_BASE)
#define FM_BT4                                    ((FM_BT_TypeDef *)FM0P_BT4_BASE)
#define FM0P_BT4_PPG                              ((FM_BT_PPG_TypeDef *)FM0P_BT4_BASE)
#define FM_BT4_PPG                                ((FM_BT_PPG_TypeDef *)FM0P_BT4_BASE)
#define FM0P_BT4_PWC                              ((FM_BT_PWC_TypeDef *)FM0P_BT4_BASE)
#define FM_BT4_PWC                                ((FM_BT_PWC_TypeDef *)FM0P_BT4_BASE)
#define FM0P_BT4_PWM                              ((FM_BT_PWM_TypeDef *)FM0P_BT4_BASE)
#define FM_BT4_PWM                                ((FM_BT_PWM_TypeDef *)FM0P_BT4_BASE)
#define FM0P_BT4_RT                               ((FM_BT_RT_TypeDef *)FM0P_BT4_BASE)
#define FM_BT4_RT                                 ((FM_BT_RT_TypeDef *)FM0P_BT4_BASE)
#define FM0P_BT5                                  ((FM_BT_TypeDef *)FM0P_BT5_BASE)
#define FM_BT5                                    ((FM_BT_TypeDef *)FM0P_BT5_BASE)
#define FM0P_BT5_PPG                              ((FM_BT_PPG_TypeDef *)FM0P_BT5_BASE)
#define FM_BT5_PPG                                ((FM_BT_PPG_TypeDef *)FM0P_BT5_BASE)
#define FM0P_BT5_PWC                              ((FM_BT_PWC_TypeDef *)FM0P_BT5_BASE)
#define FM_BT5_PWC                                ((FM_BT_PWC_TypeDef *)FM0P_BT5_BASE)
#define FM0P_BT5_PWM                              ((FM_BT_PWM_TypeDef *)FM0P_BT5_BASE)
#define FM_BT5_PWM                                ((FM_BT_PWM_TypeDef *)FM0P_BT5_BASE)
#define FM0P_BT5_RT                               ((FM_BT_RT_TypeDef *)FM0P_BT5_BASE)
#define FM_BT5_RT                                 ((FM_BT_RT_TypeDef *)FM0P_BT5_BASE)
#define FM0P_BT6                                  ((FM_BT_TypeDef *)FM0P_BT6_BASE)
#define FM_BT6                                    ((FM_BT_TypeDef *)FM0P_BT6_BASE)
#define FM0P_BT6_PPG                              ((FM_BT_PPG_TypeDef *)FM0P_BT6_BASE)
#define FM_BT6_PPG                                ((FM_BT_PPG_TypeDef *)FM0P_BT6_BASE)
#define FM0P_BT6_PWC                              ((FM_BT_PWC_TypeDef *)FM0P_BT6_BASE)
#define FM_BT6_PWC                                ((FM_BT_PWC_TypeDef *)FM0P_BT6_BASE)
#define FM0P_BT6_PWM                              ((FM_BT_PWM_TypeDef *)FM0P_BT6_BASE)
#define FM_BT6_PWM                                ((FM_BT_PWM_TypeDef *)FM0P_BT6_BASE)
#define FM0P_BT6_RT                               ((FM_BT_RT_TypeDef *)FM0P_BT6_BASE)
#define FM_BT6_RT                                 ((FM_BT_RT_TypeDef *)FM0P_BT6_BASE)
#define FM0P_BT7                                  ((FM_BT_TypeDef *)FM0P_BT7_BASE)
#define FM_BT7                                    ((FM_BT_TypeDef *)FM0P_BT7_BASE)
#define FM0P_BT7_PPG                              ((FM_BT_PPG_TypeDef *)FM0P_BT7_BASE)
#define FM_BT7_PPG                                ((FM_BT_PPG_TypeDef *)FM0P_BT7_BASE)
#define FM0P_BT7_PWC                              ((FM_BT_PWC_TypeDef *)FM0P_BT7_BASE)
#define FM_BT7_PWC                                ((FM_BT_PWC_TypeDef *)FM0P_BT7_BASE)
#define FM0P_BT7_PWM                              ((FM_BT_PWM_TypeDef *)FM0P_BT7_BASE)
#define FM_BT7_PWM                                ((FM_BT_PWM_TypeDef *)FM0P_BT7_BASE)
#define FM0P_BT7_RT                               ((FM_BT_RT_TypeDef *)FM0P_BT7_BASE)
#define FM_BT7_RT                                 ((FM_BT_RT_TypeDef *)FM0P_BT7_BASE)
#define FM0P_BTIOSEL03                            ((FM_BTIOSEL03_TypeDef *)FM0P_BTIOSEL03_BASE)
#define FM_BTIOSEL03                              ((FM_BTIOSEL03_TypeDef *)FM0P_BTIOSEL03_BASE)
#define FM0P_BTIOSEL47                            ((FM_BTIOSEL47_TypeDef *)FM0P_BTIOSEL47_BASE)
#define FM_BTIOSEL47                              ((FM_BTIOSEL47_TypeDef *)FM0P_BTIOSEL47_BASE)
#define FM0P_CLK_GATING                           ((FM_CLK_GATING_TypeDef *)FM0P_CLK_GATING_BASE)
#define FM_CLK_GATING                             ((FM_CLK_GATING_TypeDef *)FM0P_CLK_GATING_BASE)
#define FM0P_CRC                                  ((FM_CRC_TypeDef *)FM0P_CRC_BASE)
#define FM_CRC                                    ((FM_CRC_TypeDef *)FM0P_CRC_BASE)
#define FM0P_CRG                                  ((FM_CRG_TypeDef *)FM0P_CRG_BASE)
#define FM_CRG                                    ((FM_CRG_TypeDef *)FM0P_CRG_BASE)
#define FM0P_CRTRIM                               ((FM_CRTRIM_TypeDef *)FM0P_CRTRIM_BASE)
#define FM_CRTRIM                                 ((FM_CRTRIM_TypeDef *)FM0P_CRTRIM_BASE)
#define FM0P_DS                                   ((FM_DS_TypeDef *)FM0P_DS_BASE)
#define FM_DS                                     ((FM_DS_TypeDef *)FM0P_DS_BASE)
#define FM0P_DSTC                                 ((FM_DSTC_TypeDef *)FM0P_DSTC_BASE)
#define FM_DSTC                                   ((FM_DSTC_TypeDef *)FM0P_DSTC_BASE)
#define FM0P_DT                                   ((FM_DT_TypeDef *)FM0P_DT_BASE)
#define FM_DT                                     ((FM_DT_TypeDef *)FM0P_DT_BASE)
#define FM0P_EXTI                                 ((FM_EXTI_TypeDef *)FM0P_EXTI_BASE)
#define FM_EXTI                                   ((FM_EXTI_TypeDef *)FM0P_EXTI_BASE)
#define FM0P_FASTIO                               ((FM_FASTIO_TypeDef *)FM0P_FASTIO_BASE)
#define FM_FASTIO                                 ((FM_FASTIO_TypeDef *)FM0P_FASTIO_BASE)
#define FM0P_FLASH_IF                             ((FM_FLASH_IF_TypeDef *)FM0P_FLASH_IF_BASE)
#define FM_FLASH_IF                               ((FM_FLASH_IF_TypeDef *)FM0P_FLASH_IF_BASE)
#define FM0P_GPIO                                 ((FM_GPIO_TypeDef *)FM0P_GPIO_BASE)
#define FM_GPIO                                   ((FM_GPIO_TypeDef *)FM0P_GPIO_BASE)
#define FM0P_HDMICEC0                             ((FM_HDMICEC_TypeDef *)FM0P_HDMICEC0_BASE)
#define FM_HDMICEC0                               ((FM_HDMICEC_TypeDef *)FM0P_HDMICEC0_BASE)
#define FM0P_HDMICEC1                             ((FM_HDMICEC_TypeDef *)FM0P_HDMICEC1_BASE)
#define FM_HDMICEC1                               ((FM_HDMICEC_TypeDef *)FM0P_HDMICEC1_BASE)
#define FM0P_HWWDT                                ((FM_HWWDT_TypeDef *)FM0P_HWWDT_BASE)
#define FM_HWWDT                                  ((FM_HWWDT_TypeDef *)FM0P_HWWDT_BASE)
#define FM0P_INTREQ                               ((FM_INTREQ_TypeDef *)FM0P_INTREQ_BASE)
#define FM_INTREQ                                 ((FM_INTREQ_TypeDef *)FM0P_INTREQ_BASE)
#define FM0P_LSCRP                                ((FM_LSCRP_TypeDef *)FM0P_LSCRP_BASE)
#define FM_LSCRP                                  ((FM_LSCRP_TypeDef *)FM0P_LSCRP_BASE)
#define FM0P_LVD                                  ((FM_LVD_TypeDef *)FM0P_LVD_BASE)
#define FM_LVD                                    ((FM_LVD_TypeDef *)FM0P_LVD_BASE)
#define FM0P_MFS0                                 ((FM_MFS_TypeDef *)FM0P_MFS0_BASE)
#define FM_MFS0                                   ((FM_MFS_TypeDef *)FM0P_MFS0_BASE)
#define FM0P_MFS0_CSIO                            ((FM_MFS_CSIO_TypeDef *)FM0P_MFS0_BASE)
#define FM_MFS0_CSIO                              ((FM_MFS_CSIO_TypeDef *)FM0P_MFS0_BASE)
#define FM0P_MFS0_I2C                             ((FM_MFS_I2C_TypeDef *)FM0P_MFS0_BASE)
#define FM_MFS0_I2C                               ((FM_MFS_I2C_TypeDef *)FM0P_MFS0_BASE)
#define FM0P_MFS0_LIN                             ((FM_MFS_LIN_TypeDef *)FM0P_MFS0_BASE)
#define FM_MFS0_LIN                               ((FM_MFS_LIN_TypeDef *)FM0P_MFS0_BASE)
#define FM0P_MFS0_UART                            ((FM_MFS_UART_TypeDef *)FM0P_MFS0_BASE)
#define FM_MFS0_UART                              ((FM_MFS_UART_TypeDef *)FM0P_MFS0_BASE)
#define FM0P_MFS1                                 ((FM_MFS_TypeDef *)FM0P_MFS1_BASE)
#define FM_MFS1                                   ((FM_MFS_TypeDef *)FM0P_MFS1_BASE)
#define FM0P_MFS1_CSIO                            ((FM_MFS_CSIO_TypeDef *)FM0P_MFS1_BASE)
#define FM_MFS1_CSIO                              ((FM_MFS_CSIO_TypeDef *)FM0P_MFS1_BASE)
#define FM0P_MFS1_I2C                             ((FM_MFS_I2C_TypeDef *)FM0P_MFS1_BASE)
#define FM_MFS1_I2C                               ((FM_MFS_I2C_TypeDef *)FM0P_MFS1_BASE)
#define FM0P_MFS1_LIN                             ((FM_MFS_LIN_TypeDef *)FM0P_MFS1_BASE)
#define FM_MFS1_LIN                               ((FM_MFS_LIN_TypeDef *)FM0P_MFS1_BASE)
#define FM0P_MFS1_UART                            ((FM_MFS_UART_TypeDef *)FM0P_MFS1_BASE)
#define FM_MFS1_UART                              ((FM_MFS_UART_TypeDef *)FM0P_MFS1_BASE)
#define FM0P_MFS2                                 ((FM_MFS_TypeDef *)FM0P_MFS2_BASE)
#define FM_MFS2                                   ((FM_MFS_TypeDef *)FM0P_MFS2_BASE)
#define FM0P_MFS2_CSIO                            ((FM_MFS_CSIO_TypeDef *)FM0P_MFS2_BASE)
#define FM_MFS2_CSIO                              ((FM_MFS_CSIO_TypeDef *)FM0P_MFS2_BASE)
#define FM0P_MFS2_I2C                             ((FM_MFS_I2C_TypeDef *)FM0P_MFS2_BASE)
#define FM_MFS2_I2C                               ((FM_MFS_I2C_TypeDef *)FM0P_MFS2_BASE)
#define FM0P_MFS2_LIN                             ((FM_MFS_LIN_TypeDef *)FM0P_MFS2_BASE)
#define FM_MFS2_LIN                               ((FM_MFS_LIN_TypeDef *)FM0P_MFS2_BASE)
#define FM0P_MFS2_UART                            ((FM_MFS_UART_TypeDef *)FM0P_MFS2_BASE)
#define FM_MFS2_UART                              ((FM_MFS_UART_TypeDef *)FM0P_MFS2_BASE)
#define FM0P_MFS3                                 ((FM_MFS_TypeDef *)FM0P_MFS3_BASE)
#define FM_MFS3                                   ((FM_MFS_TypeDef *)FM0P_MFS3_BASE)
#define FM0P_MFS3_CSIO                            ((FM_MFS_CSIO_TypeDef *)FM0P_MFS3_BASE)
#define FM_MFS3_CSIO                              ((FM_MFS_CSIO_TypeDef *)FM0P_MFS3_BASE)
#define FM0P_MFS3_I2C                             ((FM_MFS_I2C_TypeDef *)FM0P_MFS3_BASE)
#define FM_MFS3_I2C                               ((FM_MFS_I2C_TypeDef *)FM0P_MFS3_BASE)
#define FM0P_MFS3_LIN                             ((FM_MFS_LIN_TypeDef *)FM0P_MFS3_BASE)
#define FM_MFS3_LIN                               ((FM_MFS_LIN_TypeDef *)FM0P_MFS3_BASE)
#define FM0P_MFS3_UART                            ((FM_MFS_UART_TypeDef *)FM0P_MFS3_BASE)
#define FM_MFS3_UART                              ((FM_MFS_UART_TypeDef *)FM0P_MFS3_BASE)
#define FM0P_MFS4                                 ((FM_MFS_TypeDef *)FM0P_MFS4_BASE)
#define FM_MFS4                                   ((FM_MFS_TypeDef *)FM0P_MFS4_BASE)
#define FM0P_MFS4_CSIO                            ((FM_MFS_CSIO_TypeDef *)FM0P_MFS4_BASE)
#define FM_MFS4_CSIO                              ((FM_MFS_CSIO_TypeDef *)FM0P_MFS4_BASE)
#define FM0P_MFS4_I2C                             ((FM_MFS_I2C_TypeDef *)FM0P_MFS4_BASE)
#define FM_MFS4_I2C                               ((FM_MFS_I2C_TypeDef *)FM0P_MFS4_BASE)
#define FM0P_MFS4_LIN                             ((FM_MFS_LIN_TypeDef *)FM0P_MFS4_BASE)
#define FM_MFS4_LIN                               ((FM_MFS_LIN_TypeDef *)FM0P_MFS4_BASE)
#define FM0P_MFS4_UART                            ((FM_MFS_UART_TypeDef *)FM0P_MFS4_BASE)
#define FM_MFS4_UART                              ((FM_MFS_UART_TypeDef *)FM0P_MFS4_BASE)
#define FM0P_MFS5                                 ((FM_MFS_TypeDef *)FM0P_MFS5_BASE)
#define FM_MFS5                                   ((FM_MFS_TypeDef *)FM0P_MFS5_BASE)
#define FM0P_MFS5_CSIO                            ((FM_MFS_CSIO_TypeDef *)FM0P_MFS5_BASE)
#define FM_MFS5_CSIO                              ((FM_MFS_CSIO_TypeDef *)FM0P_MFS5_BASE)
#define FM0P_MFS5_I2C                             ((FM_MFS_I2C_TypeDef *)FM0P_MFS5_BASE)
#define FM_MFS5_I2C                               ((FM_MFS_I2C_TypeDef *)FM0P_MFS5_BASE)
#define FM0P_MFS5_I2S                             ((FM_MFS_I2S_TypeDef *)FM0P_MFS5_BASE)
#define FM_MFS5_I2S                               ((FM_MFS_I2S_TypeDef *)FM0P_MFS5_BASE)
#define FM0P_MFS5_LIN                             ((FM_MFS_LIN_TypeDef *)FM0P_MFS5_BASE)
#define FM_MFS5_LIN                               ((FM_MFS_LIN_TypeDef *)FM0P_MFS5_BASE)
#define FM0P_MFS5_UART                            ((FM_MFS_UART_TypeDef *)FM0P_MFS5_BASE)
#define FM_MFS5_UART                              ((FM_MFS_UART_TypeDef *)FM0P_MFS5_BASE)
#define FM0P_MFS6                                 ((FM_MFS_TypeDef *)FM0P_MFS6_BASE)
#define FM_MFS6                                   ((FM_MFS_TypeDef *)FM0P_MFS6_BASE)
#define FM0P_MFS6_CSIO                            ((FM_MFS_CSIO_TypeDef *)FM0P_MFS6_BASE)
#define FM_MFS6_CSIO                              ((FM_MFS_CSIO_TypeDef *)FM0P_MFS6_BASE)
#define FM0P_MFS6_I2C                             ((FM_MFS_I2C_TypeDef *)FM0P_MFS6_BASE)
#define FM_MFS6_I2C                               ((FM_MFS_I2C_TypeDef *)FM0P_MFS6_BASE)
#define FM0P_MFS6_I2S                             ((FM_MFS_I2S_TypeDef *)FM0P_MFS6_BASE)
#define FM_MFS6_I2S                               ((FM_MFS_I2S_TypeDef *)FM0P_MFS6_BASE)
#define FM0P_MFS6_LIN                             ((FM_MFS_LIN_TypeDef *)FM0P_MFS6_BASE)
#define FM_MFS6_LIN                               ((FM_MFS_LIN_TypeDef *)FM0P_MFS6_BASE)
#define FM0P_MFS6_UART                            ((FM_MFS_UART_TypeDef *)FM0P_MFS6_BASE)
#define FM_MFS6_UART                              ((FM_MFS_UART_TypeDef *)FM0P_MFS6_BASE)
#define FM0P_MFS7                                 ((FM_MFS_TypeDef *)FM0P_MFS7_BASE)
#define FM_MFS7                                   ((FM_MFS_TypeDef *)FM0P_MFS7_BASE)
#define FM0P_MFS7_CSIO                            ((FM_MFS_CSIO_TypeDef *)FM0P_MFS7_BASE)
#define FM_MFS7_CSIO                              ((FM_MFS_CSIO_TypeDef *)FM0P_MFS7_BASE)
#define FM0P_MFS7_I2C                             ((FM_MFS_I2C_TypeDef *)FM0P_MFS7_BASE)
#define FM_MFS7_I2C                               ((FM_MFS_I2C_TypeDef *)FM0P_MFS7_BASE)
#define FM0P_MFS7_LIN                             ((FM_MFS_LIN_TypeDef *)FM0P_MFS7_BASE)
#define FM_MFS7_LIN                               ((FM_MFS_LIN_TypeDef *)FM0P_MFS7_BASE)
#define FM0P_MFS7_UART                            ((FM_MFS_UART_TypeDef *)FM0P_MFS7_BASE)
#define FM_MFS7_UART                              ((FM_MFS_UART_TypeDef *)FM0P_MFS7_BASE)
#define FM0P_MFSI2S0                              ((FM_MFSI2S_TypeDef *)FM0P_MFSI2S0_BASE)
#define FM_MFSI2S0                                ((FM_MFSI2S_TypeDef *)FM0P_MFSI2S0_BASE)
#define FM0P_MFSI2S1                              ((FM_MFSI2S_TypeDef *)FM0P_MFSI2S1_BASE)
#define FM_MFSI2S1                                ((FM_MFSI2S_TypeDef *)FM0P_MFSI2S1_BASE)
#define FM0P_MFT_PPG                              ((FM_MFT_PPG_TypeDef *)FM0P_MFT_PPG_BASE)
#define FM_MFT_PPG                                ((FM_MFT_PPG_TypeDef *)FM0P_MFT_PPG_BASE)
#define FM0P_MFT0                                 ((FM_MFT_TypeDef *)FM0P_MFT0_BASE)
#define FM_MFT0                                   ((FM_MFT_TypeDef *)FM0P_MFT0_BASE)
#define FM0P_MFT0_ADCMP                           ((FM_MFT_ADCMP_TypeDef *)FM0P_MFT0_BASE)
#define FM_MFT0_ADCMP                             ((FM_MFT_ADCMP_TypeDef *)FM0P_MFT0_BASE)
#define FM0P_MFT0_FRT                             ((FM_MFT_FRT_TypeDef *)FM0P_MFT0_BASE)
#define FM_MFT0_FRT                               ((FM_MFT_FRT_TypeDef *)FM0P_MFT0_BASE)
#define FM0P_MFT0_ICU                             ((FM_MFT_ICU_TypeDef *)FM0P_MFT0_BASE)
#define FM_MFT0_ICU                               ((FM_MFT_ICU_TypeDef *)FM0P_MFT0_BASE)
#define FM0P_MFT0_OCU                             ((FM_MFT_OCU_TypeDef *)FM0P_MFT0_BASE)
#define FM_MFT0_OCU                               ((FM_MFT_OCU_TypeDef *)FM0P_MFT0_BASE)
#define FM0P_MFT0_WFG                             ((FM_MFT_WFG_TypeDef *)FM0P_MFT0_BASE)
#define FM_MFT0_WFG                               ((FM_MFT_WFG_TypeDef *)FM0P_MFT0_BASE)
#define FM0P_MTB_DWT                              ((FM_MTB_DWT_TypeDef *)FM0P_MTB_DWT_BASE)
#define FM_MTB_DWT                                ((FM_MTB_DWT_TypeDef *)FM0P_MTB_DWT_BASE)
#define FM0P_RTC                                  ((FM_RTC_TypeDef *)FM0P_RTC_BASE)
#define FM_RTC                                    ((FM_RTC_TypeDef *)FM0P_RTC_BASE)
#define FM0P_SBSSR                                ((FM_SBSSR_TypeDef *)FM0P_SBSSR_BASE)
#define FM_SBSSR                                  ((FM_SBSSR_TypeDef *)FM0P_SBSSR_BASE)
#define FM0P_SMCIF0                               ((FM_SMCIF_TypeDef *)FM0P_SMCIF0_BASE)
#define FM_SMCIF0                                 ((FM_SMCIF_TypeDef *)FM0P_SMCIF0_BASE)
#define FM0P_SMCIF1                               ((FM_SMCIF_TypeDef *)FM0P_SMCIF1_BASE)
#define FM_SMCIF1                                 ((FM_SMCIF_TypeDef *)FM0P_SMCIF1_BASE)
#define FM0P_SWWDT                                ((FM_SWWDT_TypeDef *)FM0P_SWWDT_BASE)
#define FM_SWWDT                                  ((FM_SWWDT_TypeDef *)FM0P_SWWDT_BASE)
#define FM0P_UNIQUE_ID                            ((FM_UNIQUE_ID_TypeDef *)FM0P_UNIQUE_ID_BASE)
#define FM_UNIQUE_ID                              ((FM_UNIQUE_ID_TypeDef *)FM0P_UNIQUE_ID_BASE)
#define FM0P_USB0                                 ((FM_USB_TypeDef *)FM0P_USB0_BASE)
#define FM_USB0                                   ((FM_USB_TypeDef *)FM0P_USB0_BASE)
#define FM0P_USBCLK                               ((FM_USBCLK_TypeDef *)FM0P_USBCLK_BASE)
#define FM_USBCLK                                 ((FM_USBCLK_TypeDef *)FM0P_USBCLK_BASE)
#define FM0P_WC                                   ((FM_WC_TypeDef *)FM0P_WC_BASE)
#define FM_WC                                     ((FM_WC_TypeDef *)FM0P_WC_BASE)
/*******************************************************************************
* Register Definitions
*******************************************************************************/
/*******************************************************************************
* ADC Registers ADC0
*   Register Definition
*******************************************************************************/
#define FM_ADC0_ADSR                              *((volatile  uint8_t*)(0x40027000UL))
#define FM0P_ADC0_ADSR                            *((volatile  uint8_t*)(0x40027000UL))
#define FM_ADC0_ADCR                              *((volatile  uint8_t*)(0x40027001UL))
#define FM0P_ADC0_ADCR                            *((volatile  uint8_t*)(0x40027001UL))
#define FM_ADC0_SFNS                              *((volatile  uint8_t*)(0x40027008UL))
#define FM0P_ADC0_SFNS                            *((volatile  uint8_t*)(0x40027008UL))
#define FM_ADC0_SCCR                              *((volatile  uint8_t*)(0x40027009UL))
