mdhardenburgh/Cypress_PDL_2.1.0/devices/fm0p/s6e1b3xf/common/s6e1b3xf.h
/*******************************************************************************
* MFS Registers MFS5
*   Register Definition
*******************************************************************************/
#define FM_MFS5_CSIO_SMR                          *((volatile  uint8_t*)(0x40038500UL))
#define FM0P_MFS5_CSIO_SMR                        *((volatile  uint8_t*)(0x40038500UL))
#define FM_MFS5_I2C_SMR                           *((volatile  uint8_t*)(0x40038500UL))
#define FM0P_MFS5_I2C_SMR                         *((volatile  uint8_t*)(0x40038500UL))
#define FM_MFS5_I2S_SMR                           *((volatile  uint8_t*)(0x40038500UL))
#define FM0P_MFS5_I2S_SMR                         *((volatile  uint8_t*)(0x40038500UL))
#define FM_MFS5_LIN_SMR                           *((volatile  uint8_t*)(0x40038500UL))
#define FM0P_MFS5_LIN_SMR                         *((volatile  uint8_t*)(0x40038500UL))
#define FM_MFS5_UART_SMR                          *((volatile  uint8_t*)(0x40038500UL))
#define FM0P_MFS5_UART_SMR                        *((volatile  uint8_t*)(0x40038500UL))
#define FM_MFS5_CSIO_SCR                          *((volatile  uint8_t*)(0x40038501UL))
#define FM0P_MFS5_CSIO_SCR                        *((volatile  uint8_t*)(0x40038501UL))
#define FM_MFS5_I2C_IBCR                          *((volatile  uint8_t*)(0x40038501UL))
#define FM0P_MFS5_I2C_IBCR                        *((volatile  uint8_t*)(0x40038501UL))
#define FM_MFS5_I2S_SCR                           *((volatile  uint8_t*)(0x40038501UL))
#define FM0P_MFS5_I2S_SCR                         *((volatile  uint8_t*)(0x40038501UL))
#define FM_MFS5_LIN_SCR                           *((volatile  uint8_t*)(0x40038501UL))
#define FM0P_MFS5_LIN_SCR                         *((volatile  uint8_t*)(0x40038501UL))
#define FM_MFS5_UART_SCR                          *((volatile  uint8_t*)(0x40038501UL))
#define FM0P_MFS5_UART_SCR                        *((volatile  uint8_t*)(0x40038501UL))
#define FM_MFS5_CSIO_ESCR                         *((volatile  uint8_t*)(0x40038504UL))
#define FM0P_MFS5_CSIO_ESCR                       *((volatile  uint8_t*)(0x40038504UL))
#define FM_MFS5_I2C_IBSR                          *((volatile  uint8_t*)(0x40038504UL))
#define FM0P_MFS5_I2C_IBSR                        *((volatile  uint8_t*)(0x40038504UL))
#define FM_MFS5_I2S_ESCR                          *((volatile  uint8_t*)(0x40038504UL))
#define FM0P_MFS5_I2S_ESCR                        *((volatile  uint8_t*)(0x40038504UL))
#define FM_MFS5_LIN_ESCR                          *((volatile  uint8_t*)(0x40038504UL))
#define FM0P_MFS5_LIN_ESCR                        *((volatile  uint8_t*)(0x40038504UL))
#define FM_MFS5_UART_ESCR                         *((volatile  uint8_t*)(0x40038504UL))
#define FM0P_MFS5_UART_ESCR                       *((volatile  uint8_t*)(0x40038504UL))
#define FM_MFS5_CSIO_SSR                          *((volatile  uint8_t*)(0x40038505UL))
#define FM0P_MFS5_CSIO_SSR                        *((volatile  uint8_t*)(0x40038505UL))
#define FM_MFS5_I2C_SSR                           *((volatile  uint8_t*)(0x40038505UL))
#define FM0P_MFS5_I2C_SSR                         *((volatile  uint8_t*)(0x40038505UL))
#define FM_MFS5_I2S_SSR                           *((volatile  uint8_t*)(0x40038505UL))
#define FM0P_MFS5_I2S_SSR                         *((volatile  uint8_t*)(0x40038505UL))
#define FM_MFS5_LIN_SSR                           *((volatile  uint8_t*)(0x40038505UL))
#define FM0P_MFS5_LIN_SSR                         *((volatile  uint8_t*)(0x40038505UL))
#define FM_MFS5_UART_SSR                          *((volatile  uint8_t*)(0x40038505UL))
#define FM0P_MFS5_UART_SSR                        *((volatile  uint8_t*)(0x40038505UL))
#define FM_MFS5_CSIO_RDR                          *((volatile uint16_t*)(0x40038508UL))
#define FM0P_MFS5_CSIO_RDR                        *((volatile uint16_t*)(0x40038508UL))
#define FM_MFS5_CSIO_TDR                          *((volatile uint16_t*)(0x40038508UL))
#define FM0P_MFS5_CSIO_TDR                        *((volatile uint16_t*)(0x40038508UL))
#define FM_MFS5_I2C_RDR                           *((volatile uint16_t*)(0x40038508UL))
#define FM0P_MFS5_I2C_RDR                         *((volatile uint16_t*)(0x40038508UL))
#define FM_MFS5_I2C_TDR                           *((volatile uint16_t*)(0x40038508UL))
#define FM0P_MFS5_I2C_TDR                         *((volatile uint16_t*)(0x40038508UL))
#define FM_MFS5_I2S_RDR                           *((volatile uint32_t*)(0x40038508UL))
#define FM0P_MFS5_I2S_RDR                         *((volatile uint32_t*)(0x40038508UL))
#define FM_MFS5_I2S_TDR                           *((volatile uint32_t*)(0x40038508UL))
#define FM0P_MFS5_I2S_TDR                         *((volatile uint32_t*)(0x40038508UL))
#define FM_MFS5_LIN_RDR                           *((volatile uint16_t*)(0x40038508UL))
#define FM0P_MFS5_LIN_RDR                         *((volatile uint16_t*)(0x40038508UL))
#define FM_MFS5_LIN_TDR                           *((volatile uint16_t*)(0x40038508UL))
#define FM0P_MFS5_LIN_TDR                         *((volatile uint16_t*)(0x40038508UL))
#define FM_MFS5_UART_RDR                          *((volatile uint16_t*)(0x40038508UL))
#define FM0P_MFS5_UART_RDR                        *((volatile uint16_t*)(0x40038508UL))
#define FM_MFS5_UART_TDR                          *((volatile uint16_t*)(0x40038508UL))
#define FM0P_MFS5_UART_TDR                        *((volatile uint16_t*)(0x40038508UL))
#define FM_MFS5_CSIO_BGR                          *((volatile uint16_t*)(0x4003850CUL))
#define FM0P_MFS5_CSIO_BGR                        *((volatile uint16_t*)(0x4003850CUL))
#define FM_MFS5_I2C_BGR                           *((volatile uint16_t*)(0x4003850CUL))
#define FM0P_MFS5_I2C_BGR                         *((volatile uint16_t*)(0x4003850CUL))
#define FM_MFS5_LIN_BGR                           *((volatile uint16_t*)(0x4003850CUL))
#define FM0P_MFS5_LIN_BGR                         *((volatile uint16_t*)(0x4003850CUL))
#define FM_MFS5_UART_BGR                          *((volatile uint16_t*)(0x4003850CUL))
#define FM0P_MFS5_UART_BGR                        *((volatile uint16_t*)(0x4003850CUL))
#define FM_MFS5_I2C_ISBA                          *((volatile  uint8_t*)(0x40038510UL))
#define FM0P_MFS5_I2C_ISBA                        *((volatile  uint8_t*)(0x40038510UL))
#define FM_MFS5_I2C_ISMK                          *((volatile  uint8_t*)(0x40038511UL))
#define FM0P_MFS5_I2C_ISMK                        *((volatile  uint8_t*)(0x40038511UL))
#define FM_MFS5_CSIO_FCR                          *((volatile uint16_t*)(0x40038514UL))
#define FM0P_MFS5_CSIO_FCR                        *((volatile uint16_t*)(0x40038514UL))
#define FM_MFS5_I2C_FCR                           *((volatile uint16_t*)(0x40038514UL))
#define FM0P_MFS5_I2C_FCR                         *((volatile uint16_t*)(0x40038514UL))
#define FM_MFS5_I2S_FCR                           *((volatile uint16_t*)(0x40038514UL))
#define FM0P_MFS5_I2S_FCR                         *((volatile uint16_t*)(0x40038514UL))
#define FM_MFS5_LIN_FCR                           *((volatile uint16_t*)(0x40038514UL))
#define FM0P_MFS5_LIN_FCR                         *((volatile uint16_t*)(0x40038514UL))
#define FM_MFS5_UART_FCR                          *((volatile uint16_t*)(0x40038514UL))
#define FM0P_MFS5_UART_FCR                        *((volatile uint16_t*)(0x40038514UL))
#define FM_MFS5_CSIO_FBYTE1                       *((volatile  uint8_t*)(0x40038518UL))
#define FM0P_MFS5_CSIO_FBYTE1                     *((volatile  uint8_t*)(0x40038518UL))
#define FM_MFS5_I2C_FBYTE1                        *((volatile  uint8_t*)(0x40038518UL))
#define FM0P_MFS5_I2C_FBYTE1                      *((volatile  uint8_t*)(0x40038518UL))
#define FM_MFS5_I2S_FBYTE1                        *((volatile  uint8_t*)(0x40038518UL))
#define FM0P_MFS5_I2S_FBYTE1                      *((volatile  uint8_t*)(0x40038518UL))
#define FM_MFS5_LIN_FBYTE1                        *((volatile  uint8_t*)(0x40038518UL))
#define FM0P_MFS5_LIN_FBYTE1                      *((volatile  uint8_t*)(0x40038518UL))
#define FM_MFS5_UART_FBYTE1                       *((volatile  uint8_t*)(0x40038518UL))
#define FM0P_MFS5_UART_FBYTE1                     *((volatile  uint8_t*)(0x40038518UL))
#define FM_MFS5_CSIO_FBYTE2                       *((volatile  uint8_t*)(0x40038519UL))
#define FM0P_MFS5_CSIO_FBYTE2                     *((volatile  uint8_t*)(0x40038519UL))
#define FM_MFS5_I2C_FBYTE2                        *((volatile  uint8_t*)(0x40038519UL))
#define FM0P_MFS5_I2C_FBYTE2                      *((volatile  uint8_t*)(0x40038519UL))
#define FM_MFS5_I2S_FBYTE2                        *((volatile  uint8_t*)(0x40038519UL))
#define FM0P_MFS5_I2S_FBYTE2                      *((volatile  uint8_t*)(0x40038519UL))
#define FM_MFS5_LIN_FBYTE2                        *((volatile  uint8_t*)(0x40038519UL))
#define FM0P_MFS5_LIN_FBYTE2                      *((volatile  uint8_t*)(0x40038519UL))
#define FM_MFS5_UART_FBYTE2                       *((volatile  uint8_t*)(0x40038519UL))
#define FM0P_MFS5_UART_FBYTE2                     *((volatile  uint8_t*)(0x40038519UL))
#define FM_MFS5_CSIO_SCSTR0                       *((volatile  uint8_t*)(0x4003851CUL))
#define FM0P_MFS5_CSIO_SCSTR0                     *((volatile  uint8_t*)(0x4003851CUL))
#define FM_MFS5_CSIO_SCSTR1                       *((volatile  uint8_t*)(0x4003851DUL))
#define FM0P_MFS5_CSIO_SCSTR1                     *((volatile  uint8_t*)(0x4003851DUL))
#define FM_MFS5_I2C_EIBCR                         *((volatile  uint8_t*)(0x4003851DUL))
#define FM0P_MFS5_I2C_EIBCR                       *((volatile  uint8_t*)(0x4003851DUL))
#define FM_MFS5_CSIO_SCSTR32                      *((volatile uint16_t*)(0x40038520UL))
#define FM0P_MFS5_CSIO_SCSTR32                    *((volatile uint16_t*)(0x40038520UL))
#define FM_MFS5_CSIO_SACSR                        *((volatile uint16_t*)(0x40038524UL))
#define FM0P_MFS5_CSIO_SACSR                      *((volatile uint16_t*)(0x40038524UL))
#define FM_MFS5_CSIO_STMR                         *((volatile uint16_t*)(0x40038528UL))
#define FM0P_MFS5_CSIO_STMR                       *((volatile uint16_t*)(0x40038528UL))
#define FM_MFS5_CSIO_STMCR                        *((volatile uint16_t*)(0x4003852CUL))
#define FM0P_MFS5_CSIO_STMCR                      *((volatile uint16_t*)(0x4003852CUL))
#define FM_MFS5_CSIO_SCSCR                        *((volatile uint16_t*)(0x40038530UL))
#define FM0P_MFS5_CSIO_SCSCR                      *((volatile uint16_t*)(0x40038530UL))
#define FM_MFS5_CSIO_SCSFR0                       *((volatile  uint8_t*)(0x40038534UL))
#define FM0P_MFS5_CSIO_SCSFR0                     *((volatile  uint8_t*)(0x40038534UL))
#define FM_MFS5_CSIO_SCSFR1                       *((volatile  uint8_t*)(0x40038535UL))
#define FM0P_MFS5_CSIO_SCSFR1                     *((volatile  uint8_t*)(0x40038535UL))
#define FM_MFS5_CSIO_SCSFR2                       *((volatile  uint8_t*)(0x40038538UL))
#define FM0P_MFS5_CSIO_SCSFR2                     *((volatile  uint8_t*)(0x40038538UL))
#define FM_MFS5_CSIO_TBYTE0                       *((volatile  uint8_t*)(0x4003853CUL))
#define FM0P_MFS5_CSIO_TBYTE0                     *((volatile  uint8_t*)(0x4003853CUL))
#define FM_MFS5_CSIO_TBYTE1                       *((volatile  uint8_t*)(0x4003853DUL))
#define FM0P_MFS5_CSIO_TBYTE1                     *((volatile  uint8_t*)(0x4003853DUL))
#define FM_MFS5_CSIO_TBYTE2                       *((volatile  uint8_t*)(0x40038540UL))
#define FM0P_MFS5_CSIO_TBYTE2                     *((volatile  uint8_t*)(0x40038540UL))
#define FM_MFS5_CSIO_TBYTE3                       *((volatile  uint8_t*)(0x40038541UL))
#define FM0P_MFS5_CSIO_TBYTE3                     *((volatile  uint8_t*)(0x40038541UL))

