mdhardenburgh/Cypress_PDL_2.1.0/devices/fm0p/s6e1b3xf/common/s6e1b3xf.h
/*******************************************************************************
* MFS Registers MFS6
*   Register Definition
*******************************************************************************/
#define FM_MFS6_CSIO_SMR                          *((volatile  uint8_t*)(0x40038600UL))
#define FM0P_MFS6_CSIO_SMR                        *((volatile  uint8_t*)(0x40038600UL))
#define FM_MFS6_I2C_SMR                           *((volatile  uint8_t*)(0x40038600UL))
#define FM0P_MFS6_I2C_SMR                         *((volatile  uint8_t*)(0x40038600UL))
#define FM_MFS6_I2S_SMR                           *((volatile  uint8_t*)(0x40038600UL))
#define FM0P_MFS6_I2S_SMR                         *((volatile  uint8_t*)(0x40038600UL))
#define FM_MFS6_LIN_SMR                           *((volatile  uint8_t*)(0x40038600UL))
#define FM0P_MFS6_LIN_SMR                         *((volatile  uint8_t*)(0x40038600UL))
#define FM_MFS6_UART_SMR                          *((volatile  uint8_t*)(0x40038600UL))
#define FM0P_MFS6_UART_SMR                        *((volatile  uint8_t*)(0x40038600UL))
#define FM_MFS6_CSIO_SCR                          *((volatile  uint8_t*)(0x40038601UL))
#define FM0P_MFS6_CSIO_SCR                        *((volatile  uint8_t*)(0x40038601UL))
#define FM_MFS6_I2C_IBCR                          *((volatile  uint8_t*)(0x40038601UL))
#define FM0P_MFS6_I2C_IBCR                        *((volatile  uint8_t*)(0x40038601UL))
#define FM_MFS6_I2S_SCR                           *((volatile  uint8_t*)(0x40038601UL))
#define FM0P_MFS6_I2S_SCR                         *((volatile  uint8_t*)(0x40038601UL))
#define FM_MFS6_LIN_SCR                           *((volatile  uint8_t*)(0x40038601UL))
#define FM0P_MFS6_LIN_SCR                         *((volatile  uint8_t*)(0x40038601UL))
#define FM_MFS6_UART_SCR                          *((volatile  uint8_t*)(0x40038601UL))
#define FM0P_MFS6_UART_SCR                        *((volatile  uint8_t*)(0x40038601UL))
#define FM_MFS6_CSIO_ESCR                         *((volatile  uint8_t*)(0x40038604UL))
#define FM0P_MFS6_CSIO_ESCR                       *((volatile  uint8_t*)(0x40038604UL))
#define FM_MFS6_I2C_IBSR                          *((volatile  uint8_t*)(0x40038604UL))
#define FM0P_MFS6_I2C_IBSR                        *((volatile  uint8_t*)(0x40038604UL))
#define FM_MFS6_I2S_ESCR                          *((volatile  uint8_t*)(0x40038604UL))
#define FM0P_MFS6_I2S_ESCR                        *((volatile  uint8_t*)(0x40038604UL))
#define FM_MFS6_LIN_ESCR                          *((volatile  uint8_t*)(0x40038604UL))
#define FM0P_MFS6_LIN_ESCR                        *((volatile  uint8_t*)(0x40038604UL))
#define FM_MFS6_UART_ESCR                         *((volatile  uint8_t*)(0x40038604UL))
#define FM0P_MFS6_UART_ESCR                       *((volatile  uint8_t*)(0x40038604UL))
#define FM_MFS6_CSIO_SSR                          *((volatile  uint8_t*)(0x40038605UL))
#define FM0P_MFS6_CSIO_SSR                        *((volatile  uint8_t*)(0x40038605UL))
#define FM_MFS6_I2C_SSR                           *((volatile  uint8_t*)(0x40038605UL))
#define FM0P_MFS6_I2C_SSR                         *((volatile  uint8_t*)(0x40038605UL))
#define FM_MFS6_I2S_SSR                           *((volatile  uint8_t*)(0x40038605UL))
#define FM0P_MFS6_I2S_SSR                         *((volatile  uint8_t*)(0x40038605UL))
#define FM_MFS6_LIN_SSR                           *((volatile  uint8_t*)(0x40038605UL))
#define FM0P_MFS6_LIN_SSR                         *((volatile  uint8_t*)(0x40038605UL))
#define FM_MFS6_UART_SSR                          *((volatile  uint8_t*)(0x40038605UL))
#define FM0P_MFS6_UART_SSR                        *((volatile  uint8_t*)(0x40038605UL))
#define FM_MFS6_CSIO_RDR                          *((volatile uint16_t*)(0x40038608UL))
#define FM0P_MFS6_CSIO_RDR                        *((volatile uint16_t*)(0x40038608UL))
#define FM_MFS6_CSIO_TDR                          *((volatile uint16_t*)(0x40038608UL))
#define FM0P_MFS6_CSIO_TDR                        *((volatile uint16_t*)(0x40038608UL))
#define FM_MFS6_I2C_RDR                           *((volatile uint16_t*)(0x40038608UL))
#define FM0P_MFS6_I2C_RDR                         *((volatile uint16_t*)(0x40038608UL))
#define FM_MFS6_I2C_TDR                           *((volatile uint16_t*)(0x40038608UL))
#define FM0P_MFS6_I2C_TDR                         *((volatile uint16_t*)(0x40038608UL))
#define FM_MFS6_I2S_RDR                           *((volatile uint32_t*)(0x40038608UL))
#define FM0P_MFS6_I2S_RDR                         *((volatile uint32_t*)(0x40038608UL))
#define FM_MFS6_I2S_TDR                           *((volatile uint32_t*)(0x40038608UL))
#define FM0P_MFS6_I2S_TDR                         *((volatile uint32_t*)(0x40038608UL))
#define FM_MFS6_LIN_RDR                           *((volatile uint16_t*)(0x40038608UL))
#define FM0P_MFS6_LIN_RDR                         *((volatile uint16_t*)(0x40038608UL))
#define FM_MFS6_LIN_TDR                           *((volatile uint16_t*)(0x40038608UL))
#define FM0P_MFS6_LIN_TDR                         *((volatile uint16_t*)(0x40038608UL))
#define FM_MFS6_UART_RDR                          *((volatile uint16_t*)(0x40038608UL))
#define FM0P_MFS6_UART_RDR                        *((volatile uint16_t*)(0x40038608UL))
#define FM_MFS6_UART_TDR                          *((volatile uint16_t*)(0x40038608UL))
#define FM0P_MFS6_UART_TDR                        *((volatile uint16_t*)(0x40038608UL))
#define FM_MFS6_CSIO_BGR                          *((volatile uint16_t*)(0x4003860CUL))
#define FM0P_MFS6_CSIO_BGR                        *((volatile uint16_t*)(0x4003860CUL))
#define FM_MFS6_I2C_BGR                           *((volatile uint16_t*)(0x4003860CUL))
#define FM0P_MFS6_I2C_BGR                         *((volatile uint16_t*)(0x4003860CUL))
#define FM_MFS6_LIN_BGR                           *((volatile uint16_t*)(0x4003860CUL))
#define FM0P_MFS6_LIN_BGR                         *((volatile uint16_t*)(0x4003860CUL))
#define FM_MFS6_UART_BGR                          *((volatile uint16_t*)(0x4003860CUL))
#define FM0P_MFS6_UART_BGR                        *((volatile uint16_t*)(0x4003860CUL))
#define FM_MFS6_I2C_ISBA                          *((volatile  uint8_t*)(0x40038610UL))
#define FM0P_MFS6_I2C_ISBA                        *((volatile  uint8_t*)(0x40038610UL))
#define FM_MFS6_I2C_ISMK                          *((volatile  uint8_t*)(0x40038611UL))
#define FM0P_MFS6_I2C_ISMK                        *((volatile  uint8_t*)(0x40038611UL))
#define FM_MFS6_CSIO_FCR                          *((volatile uint16_t*)(0x40038614UL))
#define FM0P_MFS6_CSIO_FCR                        *((volatile uint16_t*)(0x40038614UL))
#define FM_MFS6_I2C_FCR                           *((volatile uint16_t*)(0x40038614UL))
#define FM0P_MFS6_I2C_FCR                         *((volatile uint16_t*)(0x40038614UL))
#define FM_MFS6_I2S_FCR                           *((volatile uint16_t*)(0x40038614UL))
#define FM0P_MFS6_I2S_FCR                         *((volatile uint16_t*)(0x40038614UL))
#define FM_MFS6_LIN_FCR                           *((volatile uint16_t*)(0x40038614UL))
#define FM0P_MFS6_LIN_FCR                         *((volatile uint16_t*)(0x40038614UL))
#define FM_MFS6_UART_FCR                          *((volatile uint16_t*)(0x40038614UL))
#define FM0P_MFS6_UART_FCR                        *((volatile uint16_t*)(0x40038614UL))
#define FM_MFS6_CSIO_FBYTE1                       *((volatile  uint8_t*)(0x40038618UL))
#define FM0P_MFS6_CSIO_FBYTE1                     *((volatile  uint8_t*)(0x40038618UL))
#define FM_MFS6_I2C_FBYTE1                        *((volatile  uint8_t*)(0x40038618UL))
#define FM0P_MFS6_I2C_FBYTE1                      *((volatile  uint8_t*)(0x40038618UL))
#define FM_MFS6_I2S_FBYTE1                        *((volatile  uint8_t*)(0x40038618UL))
#define FM0P_MFS6_I2S_FBYTE1                      *((volatile  uint8_t*)(0x40038618UL))
#define FM_MFS6_LIN_FBYTE1                        *((volatile  uint8_t*)(0x40038618UL))
#define FM0P_MFS6_LIN_FBYTE1                      *((volatile  uint8_t*)(0x40038618UL))
#define FM_MFS6_UART_FBYTE1                       *((volatile  uint8_t*)(0x40038618UL))
#define FM0P_MFS6_UART_FBYTE1                     *((volatile  uint8_t*)(0x40038618UL))
#define FM_MFS6_CSIO_FBYTE2                       *((volatile  uint8_t*)(0x40038619UL))
#define FM0P_MFS6_CSIO_FBYTE2                     *((volatile  uint8_t*)(0x40038619UL))
#define FM_MFS6_I2C_FBYTE2                        *((volatile  uint8_t*)(0x40038619UL))
#define FM0P_MFS6_I2C_FBYTE2                      *((volatile  uint8_t*)(0x40038619UL))
#define FM_MFS6_I2S_FBYTE2                        *((volatile  uint8_t*)(0x40038619UL))
#define FM0P_MFS6_I2S_FBYTE2                      *((volatile  uint8_t*)(0x40038619UL))
#define FM_MFS6_LIN_FBYTE2                        *((volatile  uint8_t*)(0x40038619UL))
#define FM0P_MFS6_LIN_FBYTE2                      *((volatile  uint8_t*)(0x40038619UL))
#define FM_MFS6_UART_FBYTE2                       *((volatile  uint8_t*)(0x40038619UL))
#define FM0P_MFS6_UART_FBYTE2                     *((volatile  uint8_t*)(0x40038619UL))
#define FM_MFS6_CSIO_SCSTR0                       *((volatile  uint8_t*)(0x4003861CUL))
#define FM0P_MFS6_CSIO_SCSTR0                     *((volatile  uint8_t*)(0x4003861CUL))
#define FM_MFS6_CSIO_SCSTR1                       *((volatile  uint8_t*)(0x4003861DUL))
#define FM0P_MFS6_CSIO_SCSTR1                     *((volatile  uint8_t*)(0x4003861DUL))
#define FM_MFS6_I2C_EIBCR                         *((volatile  uint8_t*)(0x4003861DUL))
#define FM0P_MFS6_I2C_EIBCR                       *((volatile  uint8_t*)(0x4003861DUL))
#define FM_MFS6_CSIO_SCSTR32                      *((volatile uint16_t*)(0x40038620UL))
#define FM0P_MFS6_CSIO_SCSTR32                    *((volatile uint16_t*)(0x40038620UL))
#define FM_MFS6_CSIO_SACSR                        *((volatile uint16_t*)(0x40038624UL))
#define FM0P_MFS6_CSIO_SACSR                      *((volatile uint16_t*)(0x40038624UL))
#define FM_MFS6_CSIO_STMR                         *((volatile uint16_t*)(0x40038628UL))
#define FM0P_MFS6_CSIO_STMR                       *((volatile uint16_t*)(0x40038628UL))
#define FM_MFS6_CSIO_STMCR                        *((volatile uint16_t*)(0x4003862CUL))
#define FM0P_MFS6_CSIO_STMCR                      *((volatile uint16_t*)(0x4003862CUL))
#define FM_MFS6_CSIO_SCSCR                        *((volatile uint16_t*)(0x40038630UL))
#define FM0P_MFS6_CSIO_SCSCR                      *((volatile uint16_t*)(0x40038630UL))
#define FM_MFS6_CSIO_SCSFR0                       *((volatile  uint8_t*)(0x40038634UL))
#define FM0P_MFS6_CSIO_SCSFR0                     *((volatile  uint8_t*)(0x40038634UL))
#define FM_MFS6_CSIO_SCSFR1                       *((volatile  uint8_t*)(0x40038635UL))
#define FM0P_MFS6_CSIO_SCSFR1                     *((volatile  uint8_t*)(0x40038635UL))
#define FM_MFS6_CSIO_SCSFR2                       *((volatile  uint8_t*)(0x40038638UL))
#define FM0P_MFS6_CSIO_SCSFR2                     *((volatile  uint8_t*)(0x40038638UL))
#define FM_MFS6_CSIO_TBYTE0                       *((volatile  uint8_t*)(0x4003863CUL))
#define FM0P_MFS6_CSIO_TBYTE0                     *((volatile  uint8_t*)(0x4003863CUL))
#define FM_MFS6_CSIO_TBYTE1                       *((volatile  uint8_t*)(0x4003863DUL))
#define FM0P_MFS6_CSIO_TBYTE1                     *((volatile  uint8_t*)(0x4003863DUL))
#define FM_MFS6_CSIO_TBYTE2                       *((volatile  uint8_t*)(0x40038640UL))
#define FM0P_MFS6_CSIO_TBYTE2                     *((volatile  uint8_t*)(0x40038640UL))
#define FM_MFS6_CSIO_TBYTE3                       *((volatile  uint8_t*)(0x40038641UL))
#define FM0P_MFS6_CSIO_TBYTE3                     *((volatile  uint8_t*)(0x40038641UL))

