mdhardenburgh/Cypress_PDL_2.1.0/devices/fm0p/s6e1b3xf/common/s6e1b3xf.h
#define bFM_GPIO_FPOERE_P0                        *((volatile  uint8_t *)(0x42672700UL))
#define bFM0P_GPIO_FPOERE_P0                      *((volatile  uint8_t *)(0x42672700UL))
#define bFM_GPIO_FPOERE_P2                        *((volatile  uint8_t *)(0x42672708UL))
#define bFM0P_GPIO_FPOERE_P2                      *((volatile  uint8_t *)(0x42672708UL))
#define bFM_GPIO_FPOERE_P3                        *((volatile  uint8_t *)(0x4267270CUL))
#define bFM0P_GPIO_FPOERE_P3                      *((volatile  uint8_t *)(0x4267270CUL))

#define bFM_GPIO_LVDIE_LVDIE                      *((volatile  uint8_t *)(0x4266E800UL))
#define bFM0P_GPIO_LVDIE_LVDIE                    *((volatile  uint8_t *)(0x4266E800UL))

#define bFM_GPIO_PCR0_P0                          *((volatile  uint8_t *)(0x42662000UL))
#define bFM0P_GPIO_PCR0_P0                        *((volatile  uint8_t *)(0x42662000UL))
#define bFM_GPIO_PCR0_P1                          *((volatile  uint8_t *)(0x42662004UL))
#define bFM0P_GPIO_PCR0_P1                        *((volatile  uint8_t *)(0x42662004UL))
#define bFM_GPIO_PCR0_P2                          *((volatile  uint8_t *)(0x42662008UL))
#define bFM0P_GPIO_PCR0_P2                        *((volatile  uint8_t *)(0x42662008UL))
#define bFM_GPIO_PCR0_P3                          *((volatile  uint8_t *)(0x4266200CUL))
#define bFM0P_GPIO_PCR0_P3                        *((volatile  uint8_t *)(0x4266200CUL))
#define bFM_GPIO_PCR0_P4                          *((volatile  uint8_t *)(0x42662010UL))
#define bFM0P_GPIO_PCR0_P4                        *((volatile  uint8_t *)(0x42662010UL))
#define bFM_GPIO_PCR0_P5                          *((volatile  uint8_t *)(0x42662014UL))
#define bFM0P_GPIO_PCR0_P5                        *((volatile  uint8_t *)(0x42662014UL))
#define bFM_GPIO_PCR0_P6                          *((volatile  uint8_t *)(0x42662018UL))
#define bFM0P_GPIO_PCR0_P6                        *((volatile  uint8_t *)(0x42662018UL))
#define bFM_GPIO_PCR0_P7                          *((volatile  uint8_t *)(0x4266201CUL))
#define bFM0P_GPIO_PCR0_P7                        *((volatile  uint8_t *)(0x4266201CUL))
#define bFM_GPIO_PCR0_P8                          *((volatile  uint8_t *)(0x42662020UL))
#define bFM0P_GPIO_PCR0_P8                        *((volatile  uint8_t *)(0x42662020UL))
#define bFM_GPIO_PCR0_P9                          *((volatile  uint8_t *)(0x42662024UL))
#define bFM0P_GPIO_PCR0_P9                        *((volatile  uint8_t *)(0x42662024UL))
#define bFM_GPIO_PCR0_PA                          *((volatile  uint8_t *)(0x42662028UL))
#define bFM0P_GPIO_PCR0_PA                        *((volatile  uint8_t *)(0x42662028UL))
#define bFM_GPIO_PCR0_PB                          *((volatile  uint8_t *)(0x4266202CUL))
#define bFM0P_GPIO_PCR0_PB                        *((volatile  uint8_t *)(0x4266202CUL))
#define bFM_GPIO_PCR0_PC                          *((volatile  uint8_t *)(0x42662030UL))
#define bFM0P_GPIO_PCR0_PC                        *((volatile  uint8_t *)(0x42662030UL))
#define bFM_GPIO_PCR0_PD                          *((volatile  uint8_t *)(0x42662034UL))
#define bFM0P_GPIO_PCR0_PD                        *((volatile  uint8_t *)(0x42662034UL))
#define bFM_GPIO_PCR0_PE                          *((volatile  uint8_t *)(0x42662038UL))
#define bFM0P_GPIO_PCR0_PE                        *((volatile  uint8_t *)(0x42662038UL))
#define bFM_GPIO_PCR0_PF                          *((volatile  uint8_t *)(0x4266203CUL))
#define bFM0P_GPIO_PCR0_PF                        *((volatile  uint8_t *)(0x4266203CUL))

#define bFM_GPIO_PCR1_P0                          *((volatile  uint8_t *)(0x42662080UL))
#define bFM0P_GPIO_PCR1_P0                        *((volatile  uint8_t *)(0x42662080UL))
#define bFM_GPIO_PCR1_P1                          *((volatile  uint8_t *)(0x42662084UL))
#define bFM0P_GPIO_PCR1_P1                        *((volatile  uint8_t *)(0x42662084UL))
#define bFM_GPIO_PCR1_P2                          *((volatile  uint8_t *)(0x42662088UL))
#define bFM0P_GPIO_PCR1_P2                        *((volatile  uint8_t *)(0x42662088UL))
#define bFM_GPIO_PCR1_P3                          *((volatile  uint8_t *)(0x4266208CUL))
#define bFM0P_GPIO_PCR1_P3                        *((volatile  uint8_t *)(0x4266208CUL))
#define bFM_GPIO_PCR1_P4                          *((volatile  uint8_t *)(0x42662090UL))
#define bFM0P_GPIO_PCR1_P4                        *((volatile  uint8_t *)(0x42662090UL))
#define bFM_GPIO_PCR1_P5                          *((volatile  uint8_t *)(0x42662094UL))
#define bFM0P_GPIO_PCR1_P5                        *((volatile  uint8_t *)(0x42662094UL))
#define bFM_GPIO_PCR1_P6                          *((volatile  uint8_t *)(0x42662098UL))
#define bFM0P_GPIO_PCR1_P6                        *((volatile  uint8_t *)(0x42662098UL))
#define bFM_GPIO_PCR1_P7                          *((volatile  uint8_t *)(0x4266209CUL))
#define bFM0P_GPIO_PCR1_P7                        *((volatile  uint8_t *)(0x4266209CUL))
#define bFM_GPIO_PCR1_P8                          *((volatile  uint8_t *)(0x426620A0UL))
#define bFM0P_GPIO_PCR1_P8                        *((volatile  uint8_t *)(0x426620A0UL))
#define bFM_GPIO_PCR1_P9                          *((volatile  uint8_t *)(0x426620A4UL))
#define bFM0P_GPIO_PCR1_P9                        *((volatile  uint8_t *)(0x426620A4UL))
#define bFM_GPIO_PCR1_PA                          *((volatile  uint8_t *)(0x426620A8UL))
#define bFM0P_GPIO_PCR1_PA                        *((volatile  uint8_t *)(0x426620A8UL))
#define bFM_GPIO_PCR1_PB                          *((volatile  uint8_t *)(0x426620ACUL))
#define bFM0P_GPIO_PCR1_PB                        *((volatile  uint8_t *)(0x426620ACUL))
#define bFM_GPIO_PCR1_PC                          *((volatile  uint8_t *)(0x426620B0UL))
#define bFM0P_GPIO_PCR1_PC                        *((volatile  uint8_t *)(0x426620B0UL))
#define bFM_GPIO_PCR1_PD                          *((volatile  uint8_t *)(0x426620B4UL))
#define bFM0P_GPIO_PCR1_PD                        *((volatile  uint8_t *)(0x426620B4UL))
#define bFM_GPIO_PCR1_PE                          *((volatile  uint8_t *)(0x426620B8UL))
#define bFM0P_GPIO_PCR1_PE                        *((volatile  uint8_t *)(0x426620B8UL))

#define bFM_GPIO_PCR2_P0                          *((volatile  uint8_t *)(0x42662100UL))
#define bFM0P_GPIO_PCR2_P0                        *((volatile  uint8_t *)(0x42662100UL))
#define bFM_GPIO_PCR2_P1                          *((volatile  uint8_t *)(0x42662104UL))
#define bFM0P_GPIO_PCR2_P1                        *((volatile  uint8_t *)(0x42662104UL))
#define bFM_GPIO_PCR2_P2                          *((volatile  uint8_t *)(0x42662108UL))
#define bFM0P_GPIO_PCR2_P2                        *((volatile  uint8_t *)(0x42662108UL))
#define bFM_GPIO_PCR2_P3                          *((volatile  uint8_t *)(0x4266210CUL))
#define bFM0P_GPIO_PCR2_P3                        *((volatile  uint8_t *)(0x4266210CUL))

#define bFM_GPIO_PCR3_P0                          *((volatile  uint8_t *)(0x42662180UL))
#define bFM0P_GPIO_PCR3_P0                        *((volatile  uint8_t *)(0x42662180UL))
#define bFM_GPIO_PCR3_P1                          *((volatile  uint8_t *)(0x42662184UL))
#define bFM0P_GPIO_PCR3_P1                        *((volatile  uint8_t *)(0x42662184UL))
#define bFM_GPIO_PCR3_P2                          *((volatile  uint8_t *)(0x42662188UL))
#define bFM0P_GPIO_PCR3_P2                        *((volatile  uint8_t *)(0x42662188UL))
#define bFM_GPIO_PCR3_P3                          *((volatile  uint8_t *)(0x4266218CUL))
#define bFM0P_GPIO_PCR3_P3                        *((volatile  uint8_t *)(0x4266218CUL))
#define bFM_GPIO_PCR3_P4                          *((volatile  uint8_t *)(0x42662190UL))
#define bFM0P_GPIO_PCR3_P4                        *((volatile  uint8_t *)(0x42662190UL))
#define bFM_GPIO_PCR3_P5                          *((volatile  uint8_t *)(0x42662194UL))
#define bFM0P_GPIO_PCR3_P5                        *((volatile  uint8_t *)(0x42662194UL))
#define bFM_GPIO_PCR3_P6                          *((volatile  uint8_t *)(0x42662198UL))
#define bFM0P_GPIO_PCR3_P6                        *((volatile  uint8_t *)(0x42662198UL))
#define bFM_GPIO_PCR3_P7                          *((volatile  uint8_t *)(0x4266219CUL))
#define bFM0P_GPIO_PCR3_P7                        *((volatile  uint8_t *)(0x4266219CUL))
#define bFM_GPIO_PCR3_P8                          *((volatile  uint8_t *)(0x426621A0UL))
#define bFM0P_GPIO_PCR3_P8                        *((volatile  uint8_t *)(0x426621A0UL))
#define bFM_GPIO_PCR3_P9                          *((volatile  uint8_t *)(0x426621A4UL))
#define bFM0P_GPIO_PCR3_P9                        *((volatile  uint8_t *)(0x426621A4UL))
#define bFM_GPIO_PCR3_PA                          *((volatile  uint8_t *)(0x426621A8UL))
#define bFM0P_GPIO_PCR3_PA                        *((volatile  uint8_t *)(0x426621A8UL))
#define bFM_GPIO_PCR3_PB                          *((volatile  uint8_t *)(0x426621ACUL))
#define bFM0P_GPIO_PCR3_PB                        *((volatile  uint8_t *)(0x426621ACUL))
#define bFM_GPIO_PCR3_PC                          *((volatile  uint8_t *)(0x426621B0UL))
#define bFM0P_GPIO_PCR3_PC                        *((volatile  uint8_t *)(0x426621B0UL))
#define bFM_GPIO_PCR3_PD                          *((volatile  uint8_t *)(0x426621B4UL))
#define bFM0P_GPIO_PCR3_PD                        *((volatile  uint8_t *)(0x426621B4UL))
#define bFM_GPIO_PCR3_PE                          *((volatile  uint8_t *)(0x426621B8UL))
#define bFM0P_GPIO_PCR3_PE                        *((volatile  uint8_t *)(0x426621B8UL))
#define bFM_GPIO_PCR3_PF                          *((volatile  uint8_t *)(0x426621BCUL))
#define bFM0P_GPIO_PCR3_PF                        *((volatile  uint8_t *)(0x426621BCUL))

#define bFM_GPIO_PCR4_P0                          *((volatile  uint8_t *)(0x42662200UL))
#define bFM0P_GPIO_PCR4_P0                        *((volatile  uint8_t *)(0x42662200UL))
#define bFM_GPIO_PCR4_P1                          *((volatile  uint8_t *)(0x42662204UL))
#define bFM0P_GPIO_PCR4_P1                        *((volatile  uint8_t *)(0x42662204UL))
#define bFM_GPIO_PCR4_P2                          *((volatile  uint8_t *)(0x42662208UL))
#define bFM0P_GPIO_PCR4_P2                        *((volatile  uint8_t *)(0x42662208UL))
#define bFM_GPIO_PCR4_P3                          *((volatile  uint8_t *)(0x4266220CUL))
#define bFM0P_GPIO_PCR4_P3                        *((volatile  uint8_t *)(0x4266220CUL))
#define bFM_GPIO_PCR4_P4                          *((volatile  uint8_t *)(0x42662210UL))
#define bFM0P_GPIO_PCR4_P4                        *((volatile  uint8_t *)(0x42662210UL))
#define bFM_GPIO_PCR4_P5                          *((volatile  uint8_t *)(0x42662214UL))
#define bFM0P_GPIO_PCR4_P5                        *((volatile  uint8_t *)(0x42662214UL))
#define bFM_GPIO_PCR4_P6                          *((volatile  uint8_t *)(0x42662218UL))
#define bFM0P_GPIO_PCR4_P6                        *((volatile  uint8_t *)(0x42662218UL))
#define bFM_GPIO_PCR4_P7                          *((volatile  uint8_t *)(0x4266221CUL))
#define bFM0P_GPIO_PCR4_P7                        *((volatile  uint8_t *)(0x4266221CUL))
#define bFM_GPIO_PCR4_P8                          *((volatile  uint8_t *)(0x42662220UL))
#define bFM0P_GPIO_PCR4_P8                        *((volatile  uint8_t *)(0x42662220UL))
#define bFM_GPIO_PCR4_P9                          *((volatile  uint8_t *)(0x42662224UL))
#define bFM0P_GPIO_PCR4_P9                        *((volatile  uint8_t *)(0x42662224UL))
#define bFM_GPIO_PCR4_PA                          *((volatile  uint8_t *)(0x42662228UL))
#define bFM0P_GPIO_PCR4_PA                        *((volatile  uint8_t *)(0x42662228UL))
#define bFM_GPIO_PCR4_PB                          *((volatile  uint8_t *)(0x4266222CUL))
#define bFM0P_GPIO_PCR4_PB                        *((volatile  uint8_t *)(0x4266222CUL))
#define bFM_GPIO_PCR4_PC                          *((volatile  uint8_t *)(0x42662230UL))
#define bFM0P_GPIO_PCR4_PC                        *((volatile  uint8_t *)(0x42662230UL))
#define bFM_GPIO_PCR4_PD                          *((volatile  uint8_t *)(0x42662234UL))
#define bFM0P_GPIO_PCR4_PD                        *((volatile  uint8_t *)(0x42662234UL))

#define bFM_GPIO_PCR5_P0                          *((volatile  uint8_t *)(0x42662280UL))
#define bFM0P_GPIO_PCR5_P0                        *((volatile  uint8_t *)(0x42662280UL))
#define bFM_GPIO_PCR5_P1                          *((volatile  uint8_t *)(0x42662284UL))
#define bFM0P_GPIO_PCR5_P1                        *((volatile  uint8_t *)(0x42662284UL))
#define bFM_GPIO_PCR5_P2                          *((volatile  uint8_t *)(0x42662288UL))
#define bFM0P_GPIO_PCR5_P2                        *((volatile  uint8_t *)(0x42662288UL))
#define bFM_GPIO_PCR5_P3                          *((volatile  uint8_t *)(0x4266228CUL))
#define bFM0P_GPIO_PCR5_P3                        *((volatile  uint8_t *)(0x4266228CUL))
#define bFM_GPIO_PCR5_P4                          *((volatile  uint8_t *)(0x42662290UL))
#define bFM0P_GPIO_PCR5_P4                        *((volatile  uint8_t *)(0x42662290UL))
#define bFM_GPIO_PCR5_P5                          *((volatile  uint8_t *)(0x42662294UL))
#define bFM0P_GPIO_PCR5_P5                        *((volatile  uint8_t *)(0x42662294UL))
#define bFM_GPIO_PCR5_P6                          *((volatile  uint8_t *)(0x42662298UL))
#define bFM0P_GPIO_PCR5_P6                        *((volatile  uint8_t *)(0x42662298UL))

#define bFM_GPIO_PCR6_P0                          *((volatile  uint8_t *)(0x42662300UL))
#define bFM0P_GPIO_PCR6_P0                        *((volatile  uint8_t *)(0x42662300UL))
#define bFM_GPIO_PCR6_P1                          *((volatile  uint8_t *)(0x42662304UL))
#define bFM0P_GPIO_PCR6_P1                        *((volatile  uint8_t *)(0x42662304UL))
#define bFM_GPIO_PCR6_P2                          *((volatile  uint8_t *)(0x42662308UL))
#define bFM0P_GPIO_PCR6_P2                        *((volatile  uint8_t *)(0x42662308UL))
#define bFM_GPIO_PCR6_P3                          *((volatile  uint8_t *)(0x4266230CUL))
#define bFM0P_GPIO_PCR6_P3                        *((volatile  uint8_t *)(0x4266230CUL))

#define bFM_GPIO_PCRE_P0                          *((volatile  uint8_t *)(0x42662700UL))
#define bFM0P_GPIO_PCRE_P0                        *((volatile  uint8_t *)(0x42662700UL))
#define bFM_GPIO_PCRE_P2                          *((volatile  uint8_t *)(0x42662708UL))
#define bFM0P_GPIO_PCRE_P2                        *((volatile  uint8_t *)(0x42662708UL))
#define bFM_GPIO_PCRE_P3                          *((volatile  uint8_t *)(0x4266270CUL))
#define bFM0P_GPIO_PCRE_P3                        *((volatile  uint8_t *)(0x4266270CUL))

#define bFM_GPIO_PDIR0_P0                         *((volatile  uint8_t *)(0x42666000UL))
#define bFM0P_GPIO_PDIR0_P0                       *((volatile  uint8_t *)(0x42666000UL))
#define bFM_GPIO_PDIR0_P1                         *((volatile  uint8_t *)(0x42666004UL))
#define bFM0P_GPIO_PDIR0_P1                       *((volatile  uint8_t *)(0x42666004UL))
#define bFM_GPIO_PDIR0_P2                         *((volatile  uint8_t *)(0x42666008UL))
#define bFM0P_GPIO_PDIR0_P2                       *((volatile  uint8_t *)(0x42666008UL))
#define bFM_GPIO_PDIR0_P3                         *((volatile  uint8_t *)(0x4266600CUL))
#define bFM0P_GPIO_PDIR0_P3                       *((volatile  uint8_t *)(0x4266600CUL))
#define bFM_GPIO_PDIR0_P4                         *((volatile  uint8_t *)(0x42666010UL))
#define bFM0P_GPIO_PDIR0_P4                       *((volatile  uint8_t *)(0x42666010UL))
#define bFM_GPIO_PDIR0_P5                         *((volatile  uint8_t *)(0x42666014UL))
#define bFM0P_GPIO_PDIR0_P5                       *((volatile  uint8_t *)(0x42666014UL))
#define bFM_GPIO_PDIR0_P6                         *((volatile  uint8_t *)(0x42666018UL))
#define bFM0P_GPIO_PDIR0_P6                       *((volatile  uint8_t *)(0x42666018UL))
#define bFM_GPIO_PDIR0_P7                         *((volatile  uint8_t *)(0x4266601CUL))
#define bFM0P_GPIO_PDIR0_P7                       *((volatile  uint8_t *)(0x4266601CUL))
#define bFM_GPIO_PDIR0_P8                         *((volatile  uint8_t *)(0x42666020UL))
#define bFM0P_GPIO_PDIR0_P8                       *((volatile  uint8_t *)(0x42666020UL))
#define bFM_GPIO_PDIR0_P9                         *((volatile  uint8_t *)(0x42666024UL))
#define bFM0P_GPIO_PDIR0_P9                       *((volatile  uint8_t *)(0x42666024UL))
#define bFM_GPIO_PDIR0_PA                         *((volatile  uint8_t *)(0x42666028UL))
#define bFM0P_GPIO_PDIR0_PA                       *((volatile  uint8_t *)(0x42666028UL))
#define bFM_GPIO_PDIR0_PB                         *((volatile  uint8_t *)(0x4266602CUL))
#define bFM0P_GPIO_PDIR0_PB                       *((volatile  uint8_t *)(0x4266602CUL))
#define bFM_GPIO_PDIR0_PC                         *((volatile  uint8_t *)(0x42666030UL))
#define bFM0P_GPIO_PDIR0_PC                       *((volatile  uint8_t *)(0x42666030UL))
#define bFM_GPIO_PDIR0_PD                         *((volatile  uint8_t *)(0x42666034UL))
#define bFM0P_GPIO_PDIR0_PD                       *((volatile  uint8_t *)(0x42666034UL))
#define bFM_GPIO_PDIR0_PE                         *((volatile  uint8_t *)(0x42666038UL))
#define bFM0P_GPIO_PDIR0_PE                       *((volatile  uint8_t *)(0x42666038UL))
#define bFM_GPIO_PDIR0_PF                         *((volatile  uint8_t *)(0x4266603CUL))
#define bFM0P_GPIO_PDIR0_PF                       *((volatile  uint8_t *)(0x4266603CUL))

#define bFM_GPIO_PDIR1_P0                         *((volatile  uint8_t *)(0x42666080UL))
#define bFM0P_GPIO_PDIR1_P0                       *((volatile  uint8_t *)(0x42666080UL))
#define bFM_GPIO_PDIR1_P1                         *((volatile  uint8_t *)(0x42666084UL))
#define bFM0P_GPIO_PDIR1_P1                       *((volatile  uint8_t *)(0x42666084UL))
#define bFM_GPIO_PDIR1_P2                         *((volatile  uint8_t *)(0x42666088UL))
#define bFM0P_GPIO_PDIR1_P2                       *((volatile  uint8_t *)(0x42666088UL))
#define bFM_GPIO_PDIR1_P3                         *((volatile  uint8_t *)(0x4266608CUL))
#define bFM0P_GPIO_PDIR1_P3                       *((volatile  uint8_t *)(0x4266608CUL))
#define bFM_GPIO_PDIR1_P4                         *((volatile  uint8_t *)(0x42666090UL))
#define bFM0P_GPIO_PDIR1_P4                       *((volatile  uint8_t *)(0x42666090UL))
#define bFM_GPIO_PDIR1_P5                         *((volatile  uint8_t *)(0x42666094UL))
#define bFM0P_GPIO_PDIR1_P5                       *((volatile  uint8_t *)(0x42666094UL))
#define bFM_GPIO_PDIR1_P6                         *((volatile  uint8_t *)(0x42666098UL))
#define bFM0P_GPIO_PDIR1_P6                       *((volatile  uint8_t *)(0x42666098UL))
#define bFM_GPIO_PDIR1_P7                         *((volatile  uint8_t *)(0x4266609CUL))
#define bFM0P_GPIO_PDIR1_P7                       *((volatile  uint8_t *)(0x4266609CUL))
#define bFM_GPIO_PDIR1_P8                         *((volatile  uint8_t *)(0x426660A0UL))
#define bFM0P_GPIO_PDIR1_P8                       *((volatile  uint8_t *)(0x426660A0UL))
#define bFM_GPIO_PDIR1_P9                         *((volatile  uint8_t *)(0x426660A4UL))
#define bFM0P_GPIO_PDIR1_P9                       *((volatile  uint8_t *)(0x426660A4UL))
#define bFM_GPIO_PDIR1_PA                         *((volatile  uint8_t *)(0x426660A8UL))
#define bFM0P_GPIO_PDIR1_PA                       *((volatile  uint8_t *)(0x426660A8UL))
#define bFM_GPIO_PDIR1_PB                         *((volatile  uint8_t *)(0x426660ACUL))
#define bFM0P_GPIO_PDIR1_PB                       *((volatile  uint8_t *)(0x426660ACUL))
#define bFM_GPIO_PDIR1_PC                         *((volatile  uint8_t *)(0x426660B0UL))
#define bFM0P_GPIO_PDIR1_PC                       *((volatile  uint8_t *)(0x426660B0UL))
#define bFM_GPIO_PDIR1_PD                         *((volatile  uint8_t *)(0x426660B4UL))
#define bFM0P_GPIO_PDIR1_PD                       *((volatile  uint8_t *)(0x426660B4UL))
#define bFM_GPIO_PDIR1_PE                         *((volatile  uint8_t *)(0x426660B8UL))
#define bFM0P_GPIO_PDIR1_PE                       *((volatile  uint8_t *)(0x426660B8UL))

#define bFM_GPIO_PDIR2_P0                         *((volatile  uint8_t *)(0x42666100UL))
#define bFM0P_GPIO_PDIR2_P0                       *((volatile  uint8_t *)(0x42666100UL))
#define bFM_GPIO_PDIR2_P1                         *((volatile  uint8_t *)(0x42666104UL))
#define bFM0P_GPIO_PDIR2_P1                       *((volatile  uint8_t *)(0x42666104UL))
#define bFM_GPIO_PDIR2_P2                         *((volatile  uint8_t *)(0x42666108UL))
#define bFM0P_GPIO_PDIR2_P2                       *((volatile  uint8_t *)(0x42666108UL))
#define bFM_GPIO_PDIR2_P3                         *((volatile  uint8_t *)(0x4266610CUL))
#define bFM0P_GPIO_PDIR2_P3                       *((volatile  uint8_t *)(0x4266610CUL))

