mdhardenburgh/Cypress_PDL_2.1.0/devices/fm0p/s6e1b3xf/common/s6e1b3xf.h
/*******************************************************************************
* INTREQ Registers INTREQ
*   Bitband Section
*******************************************************************************/
#define bFM_INTREQ_EXC02MON_NMI                   *((volatile  uint8_t *)(0x42620200UL))
#define bFM0P_INTREQ_EXC02MON_NMI                 *((volatile  uint8_t *)(0x42620200UL))
#define bFM_INTREQ_EXC02MON_HWINT                 *((volatile  uint8_t *)(0x42620204UL))
#define bFM0P_INTREQ_EXC02MON_HWINT               *((volatile  uint8_t *)(0x42620204UL))

#define bFM_INTREQ_IRQ00MON_FCSINT                *((volatile  uint8_t *)(0x42620280UL))
#define bFM0P_INTREQ_IRQ00MON_FCSINT              *((volatile  uint8_t *)(0x42620280UL))

#define bFM_INTREQ_IRQ01MON_SWWDTINT              *((volatile  uint8_t *)(0x42620300UL))
#define bFM0P_INTREQ_IRQ01MON_SWWDTINT            *((volatile  uint8_t *)(0x42620300UL))

#define bFM_INTREQ_IRQ02MON_LVDINT                *((volatile  uint8_t *)(0x42620380UL))
#define bFM0P_INTREQ_IRQ02MON_LVDINT              *((volatile  uint8_t *)(0x42620380UL))

#define bFM_INTREQ_IRQ04MON_EXTINT0               *((volatile  uint8_t *)(0x42620480UL))
#define bFM0P_INTREQ_IRQ04MON_EXTINT0             *((volatile  uint8_t *)(0x42620480UL))
#define bFM_INTREQ_IRQ04MON_EXTINT1               *((volatile  uint8_t *)(0x42620484UL))
#define bFM0P_INTREQ_IRQ04MON_EXTINT1             *((volatile  uint8_t *)(0x42620484UL))
#define bFM_INTREQ_IRQ04MON_EXTINT2               *((volatile  uint8_t *)(0x42620488UL))
#define bFM0P_INTREQ_IRQ04MON_EXTINT2             *((volatile  uint8_t *)(0x42620488UL))
#define bFM_INTREQ_IRQ04MON_EXTINT3               *((volatile  uint8_t *)(0x4262048CUL))
#define bFM0P_INTREQ_IRQ04MON_EXTINT3             *((volatile  uint8_t *)(0x4262048CUL))
#define bFM_INTREQ_IRQ04MON_EXTINT4               *((volatile  uint8_t *)(0x42620490UL))
#define bFM0P_INTREQ_IRQ04MON_EXTINT4             *((volatile  uint8_t *)(0x42620490UL))
#define bFM_INTREQ_IRQ04MON_EXTINT5               *((volatile  uint8_t *)(0x42620494UL))
#define bFM0P_INTREQ_IRQ04MON_EXTINT5             *((volatile  uint8_t *)(0x42620494UL))
#define bFM_INTREQ_IRQ04MON_EXTINT6               *((volatile  uint8_t *)(0x42620498UL))
#define bFM0P_INTREQ_IRQ04MON_EXTINT6             *((volatile  uint8_t *)(0x42620498UL))
#define bFM_INTREQ_IRQ04MON_EXTINT7               *((volatile  uint8_t *)(0x4262049CUL))
#define bFM0P_INTREQ_IRQ04MON_EXTINT7             *((volatile  uint8_t *)(0x4262049CUL))

#define bFM_INTREQ_IRQ05MON_EXTINT8               *((volatile  uint8_t *)(0x42620500UL))
#define bFM0P_INTREQ_IRQ05MON_EXTINT8             *((volatile  uint8_t *)(0x42620500UL))
#define bFM_INTREQ_IRQ05MON_EXTINT9               *((volatile  uint8_t *)(0x42620504UL))
#define bFM0P_INTREQ_IRQ05MON_EXTINT9             *((volatile  uint8_t *)(0x42620504UL))
#define bFM_INTREQ_IRQ05MON_EXTINT10              *((volatile  uint8_t *)(0x42620508UL))
#define bFM0P_INTREQ_IRQ05MON_EXTINT10            *((volatile  uint8_t *)(0x42620508UL))
#define bFM_INTREQ_IRQ05MON_EXTINT11              *((volatile  uint8_t *)(0x4262050CUL))
#define bFM0P_INTREQ_IRQ05MON_EXTINT11            *((volatile  uint8_t *)(0x4262050CUL))
#define bFM_INTREQ_IRQ05MON_EXTINT12              *((volatile  uint8_t *)(0x42620510UL))
#define bFM0P_INTREQ_IRQ05MON_EXTINT12            *((volatile  uint8_t *)(0x42620510UL))
#define bFM_INTREQ_IRQ05MON_EXTINT13              *((volatile  uint8_t *)(0x42620514UL))
#define bFM0P_INTREQ_IRQ05MON_EXTINT13            *((volatile  uint8_t *)(0x42620514UL))
#define bFM_INTREQ_IRQ05MON_EXTINT14              *((volatile  uint8_t *)(0x42620518UL))
#define bFM0P_INTREQ_IRQ05MON_EXTINT14            *((volatile  uint8_t *)(0x42620518UL))
#define bFM_INTREQ_IRQ05MON_EXTINT15              *((volatile  uint8_t *)(0x4262051CUL))
#define bFM0P_INTREQ_IRQ05MON_EXTINT15            *((volatile  uint8_t *)(0x4262051CUL))
#define bFM_INTREQ_IRQ05MON_EXTINT16              *((volatile  uint8_t *)(0x42620520UL))
#define bFM0P_INTREQ_IRQ05MON_EXTINT16            *((volatile  uint8_t *)(0x42620520UL))
#define bFM_INTREQ_IRQ05MON_EXTINT17              *((volatile  uint8_t *)(0x42620524UL))
#define bFM0P_INTREQ_IRQ05MON_EXTINT17            *((volatile  uint8_t *)(0x42620524UL))
#define bFM_INTREQ_IRQ05MON_EXTINT18              *((volatile  uint8_t *)(0x42620528UL))
#define bFM0P_INTREQ_IRQ05MON_EXTINT18            *((volatile  uint8_t *)(0x42620528UL))
#define bFM_INTREQ_IRQ05MON_EXTINT19              *((volatile  uint8_t *)(0x4262052CUL))
#define bFM0P_INTREQ_IRQ05MON_EXTINT19            *((volatile  uint8_t *)(0x4262052CUL))
#define bFM_INTREQ_IRQ05MON_EXTINT20              *((volatile  uint8_t *)(0x42620530UL))
#define bFM0P_INTREQ_IRQ05MON_EXTINT20            *((volatile  uint8_t *)(0x42620530UL))
#define bFM_INTREQ_IRQ05MON_EXTINT21              *((volatile  uint8_t *)(0x42620534UL))
#define bFM0P_INTREQ_IRQ05MON_EXTINT21            *((volatile  uint8_t *)(0x42620534UL))
#define bFM_INTREQ_IRQ05MON_EXTINT22              *((volatile  uint8_t *)(0x42620538UL))
#define bFM0P_INTREQ_IRQ05MON_EXTINT22            *((volatile  uint8_t *)(0x42620538UL))
#define bFM_INTREQ_IRQ05MON_EXTINT23              *((volatile  uint8_t *)(0x4262053CUL))
#define bFM0P_INTREQ_IRQ05MON_EXTINT23            *((volatile  uint8_t *)(0x4262053CUL))

#define bFM_INTREQ_IRQ07MON_MFSINT                *((volatile  uint8_t *)(0x42620600UL))
#define bFM0P_INTREQ_IRQ07MON_MFSINT              *((volatile  uint8_t *)(0x42620600UL))

#define bFM_INTREQ_IRQ09MON_MFSINT                *((volatile  uint8_t *)(0x42620700UL))
#define bFM0P_INTREQ_IRQ09MON_MFSINT              *((volatile  uint8_t *)(0x42620700UL))

#define bFM_INTREQ_IRQ11MON_MFSINT                *((volatile  uint8_t *)(0x42620800UL))
#define bFM0P_INTREQ_IRQ11MON_MFSINT              *((volatile  uint8_t *)(0x42620800UL))

#define bFM_INTREQ_IRQ13MON_MFSINT                *((volatile  uint8_t *)(0x42620900UL))
#define bFM0P_INTREQ_IRQ13MON_MFSINT              *((volatile  uint8_t *)(0x42620900UL))

#define bFM_INTREQ_IRQ15MON_MFSINT                *((volatile  uint8_t *)(0x42620A00UL))
#define bFM0P_INTREQ_IRQ15MON_MFSINT              *((volatile  uint8_t *)(0x42620A00UL))

#define bFM_INTREQ_IRQ17MON_MFSINT                *((volatile  uint8_t *)(0x42620B00UL))
#define bFM0P_INTREQ_IRQ17MON_MFSINT              *((volatile  uint8_t *)(0x42620B00UL))

#define bFM_INTREQ_IRQ19MON_MFSINT                *((volatile  uint8_t *)(0x42620C00UL))
#define bFM0P_INTREQ_IRQ19MON_MFSINT              *((volatile  uint8_t *)(0x42620C00UL))

#define bFM_INTREQ_IRQ21MON_MFSINT                *((volatile  uint8_t *)(0x42620D00UL))
#define bFM0P_INTREQ_IRQ21MON_MFSINT              *((volatile  uint8_t *)(0x42620D00UL))

