mdhardenburgh/Cypress_PDL_2.1.0/devices/fm0p/s6e1b3xf/common/s6e1b3xf.h
#define bFM_INTREQ_IRQ30MON_OCU0INT0              *((volatile  uint8_t *)(0x42621180UL))
#define bFM0P_INTREQ_IRQ30MON_OCU0INT0            *((volatile  uint8_t *)(0x42621180UL))
#define bFM_INTREQ_IRQ30MON_OCU0INT1              *((volatile  uint8_t *)(0x42621184UL))
#define bFM0P_INTREQ_IRQ30MON_OCU0INT1            *((volatile  uint8_t *)(0x42621184UL))
#define bFM_INTREQ_IRQ30MON_OCU0INT2              *((volatile  uint8_t *)(0x42621188UL))
#define bFM0P_INTREQ_IRQ30MON_OCU0INT2            *((volatile  uint8_t *)(0x42621188UL))
#define bFM_INTREQ_IRQ30MON_OCU0INT3              *((volatile  uint8_t *)(0x4262118CUL))
#define bFM0P_INTREQ_IRQ30MON_OCU0INT3            *((volatile  uint8_t *)(0x4262118CUL))
#define bFM_INTREQ_IRQ30MON_OCU0INT4              *((volatile  uint8_t *)(0x42621190UL))
#define bFM0P_INTREQ_IRQ30MON_OCU0INT4            *((volatile  uint8_t *)(0x42621190UL))
#define bFM_INTREQ_IRQ30MON_OCU0INT5              *((volatile  uint8_t *)(0x42621194UL))
#define bFM0P_INTREQ_IRQ30MON_OCU0INT5            *((volatile  uint8_t *)(0x42621194UL))

#define bFM_INTREQ_IRQ31MON_BTINT0                *((volatile  uint8_t *)(0x42621200UL))
#define bFM0P_INTREQ_IRQ31MON_BTINT0              *((volatile  uint8_t *)(0x42621200UL))
#define bFM_INTREQ_IRQ31MON_BTINT1                *((volatile  uint8_t *)(0x42621204UL))
#define bFM0P_INTREQ_IRQ31MON_BTINT1              *((volatile  uint8_t *)(0x42621204UL))
#define bFM_INTREQ_IRQ31MON_BTINT2                *((volatile  uint8_t *)(0x42621208UL))
#define bFM0P_INTREQ_IRQ31MON_BTINT2              *((volatile  uint8_t *)(0x42621208UL))
#define bFM_INTREQ_IRQ31MON_BTINT3                *((volatile  uint8_t *)(0x4262120CUL))
#define bFM0P_INTREQ_IRQ31MON_BTINT3              *((volatile  uint8_t *)(0x4262120CUL))
#define bFM_INTREQ_IRQ31MON_BTINT4                *((volatile  uint8_t *)(0x42621210UL))
#define bFM0P_INTREQ_IRQ31MON_BTINT4              *((volatile  uint8_t *)(0x42621210UL))
#define bFM_INTREQ_IRQ31MON_BTINT5                *((volatile  uint8_t *)(0x42621214UL))
#define bFM0P_INTREQ_IRQ31MON_BTINT5              *((volatile  uint8_t *)(0x42621214UL))
#define bFM_INTREQ_IRQ31MON_BTINT6                *((volatile  uint8_t *)(0x42621218UL))
#define bFM0P_INTREQ_IRQ31MON_BTINT6              *((volatile  uint8_t *)(0x42621218UL))
#define bFM_INTREQ_IRQ31MON_BTINT7                *((volatile  uint8_t *)(0x4262121CUL))
#define bFM0P_INTREQ_IRQ31MON_BTINT7              *((volatile  uint8_t *)(0x4262121CUL))
#define bFM_INTREQ_IRQ31MON_BTINT8                *((volatile  uint8_t *)(0x42621220UL))
#define bFM0P_INTREQ_IRQ31MON_BTINT8              *((volatile  uint8_t *)(0x42621220UL))
#define bFM_INTREQ_IRQ31MON_BTINT9                *((volatile  uint8_t *)(0x42621224UL))
#define bFM0P_INTREQ_IRQ31MON_BTINT9              *((volatile  uint8_t *)(0x42621224UL))
#define bFM_INTREQ_IRQ31MON_BTINT10               *((volatile  uint8_t *)(0x42621228UL))
#define bFM0P_INTREQ_IRQ31MON_BTINT10             *((volatile  uint8_t *)(0x42621228UL))
#define bFM_INTREQ_IRQ31MON_BTINT11               *((volatile  uint8_t *)(0x4262122CUL))
#define bFM0P_INTREQ_IRQ31MON_BTINT11             *((volatile  uint8_t *)(0x4262122CUL))
#define bFM_INTREQ_IRQ31MON_BTINT12               *((volatile  uint8_t *)(0x42621230UL))
#define bFM0P_INTREQ_IRQ31MON_BTINT12             *((volatile  uint8_t *)(0x42621230UL))
#define bFM_INTREQ_IRQ31MON_BTINT13               *((volatile  uint8_t *)(0x42621234UL))
#define bFM0P_INTREQ_IRQ31MON_BTINT13             *((volatile  uint8_t *)(0x42621234UL))
#define bFM_INTREQ_IRQ31MON_BTINT14               *((volatile  uint8_t *)(0x42621238UL))
#define bFM0P_INTREQ_IRQ31MON_BTINT14             *((volatile  uint8_t *)(0x42621238UL))
#define bFM_INTREQ_IRQ31MON_BTINT15               *((volatile  uint8_t *)(0x4262123CUL))
#define bFM0P_INTREQ_IRQ31MON_BTINT15             *((volatile  uint8_t *)(0x4262123CUL))
#define bFM_INTREQ_IRQ31MON_FLASHINT              *((volatile  uint8_t *)(0x4262126CUL))
#define bFM0P_INTREQ_IRQ31MON_FLASHINT            *((volatile  uint8_t *)(0x4262126CUL))

#define bFM_INTREQ_IRQCMODE_IRQCMODE              *((volatile  uint8_t *)(0x42620180UL))
#define bFM0P_INTREQ_IRQCMODE_IRQCMODE            *((volatile  uint8_t *)(0x42620180UL))


/*******************************************************************************
* LSCRP Registers LSCRP
*   Bitband Section
*******************************************************************************/

/*******************************************************************************
* LVD Registers LVD
*   Bitband Section
*******************************************************************************/
#define bFM_LVD_LVD_CLR_LVDCL                     *((volatile  uint8_t *)(0x426A011CUL))
#define bFM0P_LVD_LVD_CLR_LVDCL                   *((volatile  uint8_t *)(0x426A011CUL))
#define bFM_LVD_LVD_CLR_LVD2CL                    *((volatile  uint8_t *)(0x426A013CUL))
#define bFM0P_LVD_LVD_CLR_LVD2CL                  *((volatile  uint8_t *)(0x426A013CUL))

#define bFM_LVD_LVD_CTL_LVDIE                     *((volatile  uint8_t *)(0x426A001CUL))
#define bFM0P_LVD_LVD_CTL_LVDIE                   *((volatile  uint8_t *)(0x426A001CUL))
#define bFM_LVD_LVD_CTL_LVDRE                     *((volatile  uint8_t *)(0x426A003CUL))
#define bFM0P_LVD_LVD_CTL_LVDRE                   *((volatile  uint8_t *)(0x426A003CUL))

#define bFM_LVD_LVD_CTL2_LVDRLIE                  *((volatile  uint8_t *)(0x426A029CUL))
#define bFM0P_LVD_LVD_CTL2_LVDRLIE                *((volatile  uint8_t *)(0x426A029CUL))
#define bFM_LVD_LVD_CTL2_LVDPOL                   *((volatile  uint8_t *)(0x426A02A0UL))
#define bFM0P_LVD_LVD_CTL2_LVDPOL                 *((volatile  uint8_t *)(0x426A02A0UL))

#define bFM_LVD_LVD_STR_LVDHSTR                   *((volatile  uint8_t *)(0x426A0080UL))
#define bFM0P_LVD_LVD_STR_LVDHSTR                 *((volatile  uint8_t *)(0x426A0080UL))
#define bFM_LVD_LVD_STR_LVDIR                     *((volatile  uint8_t *)(0x426A009CUL))
#define bFM0P_LVD_LVD_STR_LVDIR                   *((volatile  uint8_t *)(0x426A009CUL))
#define bFM_LVD_LVD_STR_LVD2HSTR                  *((volatile  uint8_t *)(0x426A00A0UL))
#define bFM0P_LVD_LVD_STR_LVD2HSTR                *((volatile  uint8_t *)(0x426A00A0UL))
#define bFM_LVD_LVD_STR_LVD2IR                    *((volatile  uint8_t *)(0x426A00BCUL))
#define bFM0P_LVD_LVD_STR_LVD2IR                  *((volatile  uint8_t *)(0x426A00BCUL))

#define bFM_LVD_LVD_STR2_LVDRRDY                  *((volatile  uint8_t *)(0x426A0218UL))
#define bFM0P_LVD_LVD_STR2_LVDRRDY                *((volatile  uint8_t *)(0x426A0218UL))
#define bFM_LVD_LVD_STR2_LVDIRDY                  *((volatile  uint8_t *)(0x426A021CUL))
#define bFM0P_LVD_LVD_STR2_LVDIRDY                *((volatile  uint8_t *)(0x426A021CUL))
#define bFM_LVD_LVD_STR2_LVD2IRDY                 *((volatile  uint8_t *)(0x426A023CUL))
#define bFM0P_LVD_LVD_STR2_LVD2IRDY               *((volatile  uint8_t *)(0x426A023CUL))

