mdhardenburgh/Cypress_PDL_2.1.0/devices/fm0p/s6e1b3xf/common/s6e1b3xf.h
#define bFM_LVD_LVD2_CTL_LVD2IE                   *((volatile  uint8_t *)(0x426A031CUL))
#define bFM0P_LVD_LVD2_CTL_LVD2IE                 *((volatile  uint8_t *)(0x426A031CUL))

#define bFM_LVD_LVD2_CTL2_LVD2RLIE                *((volatile  uint8_t *)(0x426A039CUL))
#define bFM0P_LVD_LVD2_CTL2_LVD2RLIE              *((volatile  uint8_t *)(0x426A039CUL))
#define bFM_LVD_LVD2_CTL2_LVD2POL                 *((volatile  uint8_t *)(0x426A03A0UL))
#define bFM0P_LVD_LVD2_CTL2_LVD2POL               *((volatile  uint8_t *)(0x426A03A0UL))


/*******************************************************************************
* MFS Registers MFS0
*   Bitband Section
*******************************************************************************/
#define bFM_MFS0_CSIO_ESCR_CSFE                   *((volatile  uint8_t *)(0x42700094UL))
#define bFM0P_MFS0_CSIO_ESCR_CSFE                 *((volatile  uint8_t *)(0x42700094UL))
#define bFM_MFS0_CSIO_ESCR_L3                     *((volatile  uint8_t *)(0x42700098UL))
#define bFM0P_MFS0_CSIO_ESCR_L3                   *((volatile  uint8_t *)(0x42700098UL))
#define bFM_MFS0_CSIO_ESCR_SOP                    *((volatile  uint8_t *)(0x4270009CUL))
#define bFM0P_MFS0_CSIO_ESCR_SOP                  *((volatile  uint8_t *)(0x4270009CUL))

#define bFM_MFS0_CSIO_FCR_FE1                     *((volatile  uint8_t *)(0x42700280UL))
#define bFM0P_MFS0_CSIO_FCR_FE1                   *((volatile  uint8_t *)(0x42700280UL))
#define bFM_MFS0_CSIO_FCR_FE2                     *((volatile  uint8_t *)(0x42700284UL))
#define bFM0P_MFS0_CSIO_FCR_FE2                   *((volatile  uint8_t *)(0x42700284UL))
#define bFM_MFS0_CSIO_FCR_FCL1                    *((volatile  uint8_t *)(0x42700288UL))
#define bFM0P_MFS0_CSIO_FCR_FCL1                  *((volatile  uint8_t *)(0x42700288UL))
#define bFM_MFS0_CSIO_FCR_FCL2                    *((volatile  uint8_t *)(0x4270028CUL))
#define bFM0P_MFS0_CSIO_FCR_FCL2                  *((volatile  uint8_t *)(0x4270028CUL))
#define bFM_MFS0_CSIO_FCR_FSET                    *((volatile  uint8_t *)(0x42700290UL))
#define bFM0P_MFS0_CSIO_FCR_FSET                  *((volatile  uint8_t *)(0x42700290UL))
#define bFM_MFS0_CSIO_FCR_FLD                     *((volatile  uint8_t *)(0x42700294UL))
#define bFM0P_MFS0_CSIO_FCR_FLD                   *((volatile  uint8_t *)(0x42700294UL))
#define bFM_MFS0_CSIO_FCR_FLST                    *((volatile  uint8_t *)(0x42700298UL))
#define bFM0P_MFS0_CSIO_FCR_FLST                  *((volatile  uint8_t *)(0x42700298UL))
#define bFM_MFS0_CSIO_FCR_FSEL                    *((volatile  uint8_t *)(0x427002A0UL))
#define bFM0P_MFS0_CSIO_FCR_FSEL                  *((volatile  uint8_t *)(0x427002A0UL))
#define bFM_MFS0_CSIO_FCR_FTIE                    *((volatile  uint8_t *)(0x427002A4UL))
#define bFM0P_MFS0_CSIO_FCR_FTIE                  *((volatile  uint8_t *)(0x427002A4UL))
#define bFM_MFS0_CSIO_FCR_FDRQ                    *((volatile  uint8_t *)(0x427002A8UL))
#define bFM0P_MFS0_CSIO_FCR_FDRQ                  *((volatile  uint8_t *)(0x427002A8UL))
#define bFM_MFS0_CSIO_FCR_FRIIE                   *((volatile  uint8_t *)(0x427002ACUL))
#define bFM0P_MFS0_CSIO_FCR_FRIIE                 *((volatile  uint8_t *)(0x427002ACUL))
#define bFM_MFS0_CSIO_FCR_FLSTE                   *((volatile  uint8_t *)(0x427002B0UL))
#define bFM0P_MFS0_CSIO_FCR_FLSTE                 *((volatile  uint8_t *)(0x427002B0UL))

#define bFM_MFS0_CSIO_SACSR_TMRE                  *((volatile  uint8_t *)(0x42700480UL))
#define bFM0P_MFS0_CSIO_SACSR_TMRE                *((volatile  uint8_t *)(0x42700480UL))
#define bFM_MFS0_CSIO_SACSR_TSYNE                 *((volatile  uint8_t *)(0x42700498UL))
#define bFM0P_MFS0_CSIO_SACSR_TSYNE               *((volatile  uint8_t *)(0x42700498UL))
#define bFM_MFS0_CSIO_SACSR_TINTE                 *((volatile  uint8_t *)(0x4270049CUL))
#define bFM0P_MFS0_CSIO_SACSR_TINTE               *((volatile  uint8_t *)(0x4270049CUL))
#define bFM_MFS0_CSIO_SACSR_TINT                  *((volatile  uint8_t *)(0x427004A0UL))
#define bFM0P_MFS0_CSIO_SACSR_TINT                *((volatile  uint8_t *)(0x427004A0UL))
#define bFM_MFS0_CSIO_SACSR_CSE                   *((volatile  uint8_t *)(0x427004ACUL))
#define bFM0P_MFS0_CSIO_SACSR_CSE                 *((volatile  uint8_t *)(0x427004ACUL))
#define bFM_MFS0_CSIO_SACSR_CSEIE                 *((volatile  uint8_t *)(0x427004B0UL))
#define bFM0P_MFS0_CSIO_SACSR_CSEIE               *((volatile  uint8_t *)(0x427004B0UL))
#define bFM_MFS0_CSIO_SACSR_TBEEN                 *((volatile  uint8_t *)(0x427004B4UL))
#define bFM0P_MFS0_CSIO_SACSR_TBEEN               *((volatile  uint8_t *)(0x427004B4UL))

#define bFM_MFS0_CSIO_SCR_TXE                     *((volatile  uint8_t *)(0x42700020UL))
#define bFM0P_MFS0_CSIO_SCR_TXE                   *((volatile  uint8_t *)(0x42700020UL))
#define bFM_MFS0_CSIO_SCR_RXE                     *((volatile  uint8_t *)(0x42700024UL))
#define bFM0P_MFS0_CSIO_SCR_RXE                   *((volatile  uint8_t *)(0x42700024UL))
#define bFM_MFS0_CSIO_SCR_TBIE                    *((volatile  uint8_t *)(0x42700028UL))
#define bFM0P_MFS0_CSIO_SCR_TBIE                  *((volatile  uint8_t *)(0x42700028UL))
#define bFM_MFS0_CSIO_SCR_TIE                     *((volatile  uint8_t *)(0x4270002CUL))
#define bFM0P_MFS0_CSIO_SCR_TIE                   *((volatile  uint8_t *)(0x4270002CUL))
#define bFM_MFS0_CSIO_SCR_RIE                     *((volatile  uint8_t *)(0x42700030UL))
#define bFM0P_MFS0_CSIO_SCR_RIE                   *((volatile  uint8_t *)(0x42700030UL))
#define bFM_MFS0_CSIO_SCR_SPI                     *((volatile  uint8_t *)(0x42700034UL))
#define bFM0P_MFS0_CSIO_SCR_SPI                   *((volatile  uint8_t *)(0x42700034UL))
#define bFM_MFS0_CSIO_SCR_MS                      *((volatile  uint8_t *)(0x42700038UL))
#define bFM0P_MFS0_CSIO_SCR_MS                    *((volatile  uint8_t *)(0x42700038UL))
#define bFM_MFS0_CSIO_SCR_UPCL                    *((volatile  uint8_t *)(0x4270003CUL))
#define bFM0P_MFS0_CSIO_SCR_UPCL                  *((volatile  uint8_t *)(0x4270003CUL))

#define bFM_MFS0_CSIO_SCSCR_CSOE                  *((volatile  uint8_t *)(0x42700600UL))
#define bFM0P_MFS0_CSIO_SCSCR_CSOE                *((volatile  uint8_t *)(0x42700600UL))
#define bFM_MFS0_CSIO_SCSCR_CSEN0                 *((volatile  uint8_t *)(0x42700604UL))
#define bFM0P_MFS0_CSIO_SCSCR_CSEN0               *((volatile  uint8_t *)(0x42700604UL))
#define bFM_MFS0_CSIO_SCSCR_CSEN1                 *((volatile  uint8_t *)(0x42700608UL))
#define bFM0P_MFS0_CSIO_SCSCR_CSEN1               *((volatile  uint8_t *)(0x42700608UL))
#define bFM_MFS0_CSIO_SCSCR_CSEN2                 *((volatile  uint8_t *)(0x4270060CUL))
#define bFM0P_MFS0_CSIO_SCSCR_CSEN2               *((volatile  uint8_t *)(0x4270060CUL))
#define bFM_MFS0_CSIO_SCSCR_CSEN3                 *((volatile  uint8_t *)(0x42700610UL))
#define bFM0P_MFS0_CSIO_SCSCR_CSEN3               *((volatile  uint8_t *)(0x42700610UL))
#define bFM_MFS0_CSIO_SCSCR_CSLVL                 *((volatile  uint8_t *)(0x42700614UL))
#define bFM0P_MFS0_CSIO_SCSCR_CSLVL               *((volatile  uint8_t *)(0x42700614UL))
#define bFM_MFS0_CSIO_SCSCR_SCAM                  *((volatile  uint8_t *)(0x42700624UL))
#define bFM0P_MFS0_CSIO_SCSCR_SCAM                *((volatile  uint8_t *)(0x42700624UL))

#define bFM_MFS0_CSIO_SCSFR0_CS1BDS               *((volatile  uint8_t *)(0x42700690UL))
#define bFM0P_MFS0_CSIO_SCSFR0_CS1BDS             *((volatile  uint8_t *)(0x42700690UL))
#define bFM_MFS0_CSIO_SCSFR0_CS1SPI               *((volatile  uint8_t *)(0x42700694UL))
#define bFM0P_MFS0_CSIO_SCSFR0_CS1SPI             *((volatile  uint8_t *)(0x42700694UL))
#define bFM_MFS0_CSIO_SCSFR0_CS1SCINV             *((volatile  uint8_t *)(0x42700698UL))
#define bFM0P_MFS0_CSIO_SCSFR0_CS1SCINV           *((volatile  uint8_t *)(0x42700698UL))
#define bFM_MFS0_CSIO_SCSFR0_CS1CSLVL             *((volatile  uint8_t *)(0x4270069CUL))
#define bFM0P_MFS0_CSIO_SCSFR0_CS1CSLVL           *((volatile  uint8_t *)(0x4270069CUL))

#define bFM_MFS0_CSIO_SCSFR1_CS2BDS               *((volatile  uint8_t *)(0x427006B0UL))
#define bFM0P_MFS0_CSIO_SCSFR1_CS2BDS             *((volatile  uint8_t *)(0x427006B0UL))
#define bFM_MFS0_CSIO_SCSFR1_CS2SPI               *((volatile  uint8_t *)(0x427006B4UL))
#define bFM0P_MFS0_CSIO_SCSFR1_CS2SPI             *((volatile  uint8_t *)(0x427006B4UL))
#define bFM_MFS0_CSIO_SCSFR1_CS2SCINV             *((volatile  uint8_t *)(0x427006B8UL))
#define bFM0P_MFS0_CSIO_SCSFR1_CS2SCINV           *((volatile  uint8_t *)(0x427006B8UL))
#define bFM_MFS0_CSIO_SCSFR1_CS2CSLVL             *((volatile  uint8_t *)(0x427006BCUL))
#define bFM0P_MFS0_CSIO_SCSFR1_CS2CSLVL           *((volatile  uint8_t *)(0x427006BCUL))

#define bFM_MFS0_CSIO_SCSFR2_CS3BDS               *((volatile  uint8_t *)(0x42700710UL))
#define bFM0P_MFS0_CSIO_SCSFR2_CS3BDS             *((volatile  uint8_t *)(0x42700710UL))
#define bFM_MFS0_CSIO_SCSFR2_CS3SPI               *((volatile  uint8_t *)(0x42700714UL))
#define bFM0P_MFS0_CSIO_SCSFR2_CS3SPI             *((volatile  uint8_t *)(0x42700714UL))
#define bFM_MFS0_CSIO_SCSFR2_CS3SCINV             *((volatile  uint8_t *)(0x42700718UL))
#define bFM0P_MFS0_CSIO_SCSFR2_CS3SCINV           *((volatile  uint8_t *)(0x42700718UL))
#define bFM_MFS0_CSIO_SCSFR2_CS3CSLVL             *((volatile  uint8_t *)(0x4270071CUL))
#define bFM0P_MFS0_CSIO_SCSFR2_CS3CSLVL           *((volatile  uint8_t *)(0x4270071CUL))

#define bFM_MFS0_CSIO_SMR_SOE                     *((volatile  uint8_t *)(0x42700000UL))
#define bFM0P_MFS0_CSIO_SMR_SOE                   *((volatile  uint8_t *)(0x42700000UL))
#define bFM_MFS0_CSIO_SMR_SCKE                    *((volatile  uint8_t *)(0x42700004UL))
#define bFM0P_MFS0_CSIO_SMR_SCKE                  *((volatile  uint8_t *)(0x42700004UL))
#define bFM_MFS0_CSIO_SMR_BDS                     *((volatile  uint8_t *)(0x42700008UL))
#define bFM0P_MFS0_CSIO_SMR_BDS                   *((volatile  uint8_t *)(0x42700008UL))
#define bFM_MFS0_CSIO_SMR_SCINV                   *((volatile  uint8_t *)(0x4270000CUL))
#define bFM0P_MFS0_CSIO_SMR_SCINV                 *((volatile  uint8_t *)(0x4270000CUL))

#define bFM_MFS0_CSIO_SSR_TBI                     *((volatile  uint8_t *)(0x427000A0UL))
#define bFM0P_MFS0_CSIO_SSR_TBI                   *((volatile  uint8_t *)(0x427000A0UL))
#define bFM_MFS0_CSIO_SSR_TDRE                    *((volatile  uint8_t *)(0x427000A4UL))
#define bFM0P_MFS0_CSIO_SSR_TDRE                  *((volatile  uint8_t *)(0x427000A4UL))
#define bFM_MFS0_CSIO_SSR_RDRF                    *((volatile  uint8_t *)(0x427000A8UL))
#define bFM0P_MFS0_CSIO_SSR_RDRF                  *((volatile  uint8_t *)(0x427000A8UL))
#define bFM_MFS0_CSIO_SSR_ORE                     *((volatile  uint8_t *)(0x427000ACUL))
#define bFM0P_MFS0_CSIO_SSR_ORE                   *((volatile  uint8_t *)(0x427000ACUL))
#define bFM_MFS0_CSIO_SSR_REC                     *((volatile  uint8_t *)(0x427000BCUL))
#define bFM0P_MFS0_CSIO_SSR_REC                   *((volatile  uint8_t *)(0x427000BCUL))

